        IDENTIFICATION DIVISION.
        PROGRAM-ID. COPY-BOOK-NAME.
        DATA DIVISION.
           WORKING-STORAGE SECTION.
           01 COPY-BOOK-NAME.