       05 CB-SIMPLE PIC 9(2).
       05 CP-SIMP2.
          10 CB-SIMP2-A PIC 9(2).
          10 CB-SIMP2-B PIC 9(2).
       05 CP-SIMP3.
          10 CB-SIMP3-A.
                15 CB-SIMP3-AB PIC 9(2).
          10 CB-SIMP3-B.
                15 CB-SIMP3-BA PIC 9(2).
