           EXEC SQL BEGIN DECLARE SECTION END-EXEC.
              01 WS-STUDENT-REC.
                 05 WS-STUDENT-ID PIC 9(4).
                 05 WS-STUDENT-NAME PIC X(25).
                 05 WS-STUDENT-ADDRESS PIC X(50).
           EXEC SQL END DECLARE SECTION END-EXEC.