    IDENTIFICATION DIVISION.
    PROGRAM-ID. TESTCOPY.
    DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DESC.
            COPY  DESC.
       01 DESC1.
            COPY DESC1.
       01 TESTCONST.
            COPY TESTCONST.
    PROCEDURE DIVISION.
       MOVE WS-NUM1 OF DESC TO WS-NUM1 OF DESC1.
       DISPLAY "Number : " CPPP2.
    STOP RUN.