    IDENTIFICATION DIVISION.
    PROGRAM-ID. TEST-PERFORM.
    DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM1 PIC 9(9) VALUE 10 .
       01
        WS-NUM2 PIC 9(9) VALUE 10.
       01 ACCOUNT.
           05 WS-NUM3 PIC 9(9) VALUE 10.
           05 WS-NUM4 PIC 9(9) VALUE 10.
           05 WS-NUMA PIC 9(9) VALUE 10.
           05 WS-NUMB PIC 9(9) VALUE 10.
           05 WS-NUMC PIC 9(9) VALUE 10.
           05 WS-NUMD PIC 9(9) VALUE 10.
           05 WS-NUME PIC 9(9) VALUE 10.
       01 WS-ARRAYS.
           05 WS-NUMBER-ARRAY.
               10 WS-NUMBER-ITEM OCCURS 10 TIMES PIC 9(3) VALUE 0.
    PROCEDURE DIVISION.
       A-PARA.
       PERFORM C-PARA THRU E-PARA.
       PERFORM UNTIL WS-NUM3 = WS-NUM4
            PERFORM B-PARA
       END-PERFORM.
       PERFORM WS-NUM3 TIMES DISPLAY 'IN A-PARA'
       END-PERFORM
       PERFORM B-PARA VARYING WS-A FROM 1 BY 1 UNTIL WS-A=5.
       PERFORM C-PARA
          VARYING WS-NUM1 FROM 1 BY 1 UNTIL WS-NUM1 > 5
          AFTER WS-NUM2 FROM 10 BY -2 UNTIL WS-NUM2 < 0
          AFTER WS-NUM3 FROM 2 BY 2 UNTIL WS-NUM3 > 8.
       PERFORM C-PARA
          VARYING WS-NUM1 FROM 1 BY 1 UNTIL WS-NUM1 > 5
          AFTER WS-NUM2 FROM 10 BY -2 UNTIL WS-NUM2 < 0
          AFTER WS-NUM3 FROM 2 BY 2 UNTIL WS-NUM3 > 8
          WITH TEST BEFORE.
       B-PARA.
       DISPLAY 'IN B-PARA'.
       PERFORM A-PARA WITH TEST BEFORE UNTIL WS-NUM4=5.
       PERFORM A-PARA WITH TEST AFTER UNTIL WS-NUM4=5.
       GO TO E-PARA.
       GO TO C-PARA D-PARA DEPENDING ON WS-NUMD.
       STOP RUN.
       C-PARA.
       DISPLAY 'IN C-PARA'.
       D-PARA.
       DISPLAY 'IN D-PARA'.
       E-PARA.
       DISPLAY 'IN E-PARA'.