    IDENTIFICATION DIVISION.
    PROGRAM-ID. TESTSQL.
    DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL
          INCLUDE SQLCA
       END-EXEC.
       EXEC SQL
          INCLUDE 'STUDENT.dcl'
       END-EXEC.
           EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01  WK-SEGMENT-KEY-AREA.
           05  WK-SAACN-KEY               PIC X(32).
           05  W2-SAACN-KEY               PIC X(32).
           EXEC SQL END DECLARE SECTION END-EXEC.

           EXEC SQL
             DECLARE STUD005 CURSOR
               FOR SELECT * FROM STUDENT FOR UPDATE
               WHERE STUDENT-ID=1005
           END-EXEC.
    PROCEDURE DIVISION.
       EXEC SQL
          DECLARE STUD001 CURSOR
              FOR SELECT STUDENT-ID, STUDENT-NAME, STUDENT-ADDRESS
              INTO :WS-STUDENT-ID, :WS-STUDENT-NAME, :WS-STUDENT-ADDRESS FROM STUDENT
              WHERE STUDENT-ID=1004
              ORDER BY STUDENT-ID
              FOR UPDATE
       END-EXEC.
       EXEC SQL
          SELECT * INTO :STUDENT FROM STUDENT
          WHERE STUDENT-ID>=1004
       END-EXEC.
       EXEC SQL OPEN STUD005 END-EXEC
       EXEC SQL
         FETCH STUD005 INTO
           :STUDENT
       END-EXEC
       IF SQLCODE = 0
          DISPLAY WS-STUDENT-REC
       ELSE DISPLAY 'Error'
       END-IF.
    STOP RUN.