
      *  事故代码
          05 C-SA-ACCD-COD.
000400*    密码口头挂失
000500        10 C-SA-PWD-DL-WORDY     PIC X(4)
000600                                 VALUE '1111' .
000700*    密码书面挂失
000800        10 C-SA-PWD-DL-WRITTEN   PIC X(4)
000900                                 VALUE '1121' .
001600*    密码修改更新
              10 C-SA-PWD-UPDATE       PIC X(4)
001500                                 VALUE '1131' .
001000*    密码口头挂失解挂
001100        10 C-SA-PWD-RDL-WORDY    PIC X(4)
001200                                 VALUE '1211' .
001300*    密码书面挂失解挂
001400        10 C-SA-PWD-RDL-WRITTEN  PIC X(4)
001500                                 VALUE '1221' .
001300*    密码解挂补设
001400        10 C-SA-PWD-DEL-APPEND   PIC X(4)
001500                                 VALUE '1225' .
      *    密码补设生效
              10 C-SA-PWD-APPEND-ENABLE PIC X(4)
                                       VALUE '1226' .
001600*    存折口头挂失
001700        10 C-SA-PSBK-DL-WORDY    PIC X(4)
001800                                 VALUE '1112' .
001900*    存折书面挂失
002000        10 C-SA-PSBK-DL-WRITTEN  PIC X(4)
002100                                 VALUE '1122' .
002200*    存折口头挂失解挂
002300        10 C-SA-PSBK-RDL-WORDY   PIC X(4)
002400                                 VALUE '1212' .
002500*    存折书面挂失解挂
002600        10 C-SA-PSBK-RDL-WRITTEN PIC X(4)
002700                                 VALUE '1222' .
ZMF   *    存折挂失新开
              10 C-SA-PSBK-DL-RENEW    PIC X(4)
                                       VALUE '1228' .
      *    存折补设生效
              10 C-SA-PSBK-APPEND-ENABLE PIC X(4)
                                       VALUE '1227' .
002800*    印鉴口头挂失
002900        10 C-SA-SL-DL-WORDY      PIC X(4)
003000                                 VALUE '1113' .
003100*    印鉴书面挂失
003200        10 C-SA-SL-DL-WRITTEN    PIC X(4)
003300                                 VALUE '1123' .
003400*    印鉴口头挂失解挂
003500        10 C-SA-SL-RDL-WORDY     PIC X(4)
003600                                 VALUE '1213' .
003700*    印鉴书面挂失解挂
003800        10 C-SA-SL-RDL-WRITTEN   PIC X(4)
003900                                 VALUE '1223' .
004000*    支票口头挂失
004100        10 C-SA-BILL-DL-WORDY    PIC X(4)
004200                                 VALUE '1114' .
004300*    支票书面挂失
004400        10 C-SA-BILL-DL-WRITTEN  PIC X(4)
004500                                 VALUE '1124' .
004600*    支票口头挂失解挂
004700        10 C-SA-BILL-RDL-WORDY   PIC X(4)
004800                                 VALUE '1214' .
004900*    支票书面挂失解挂
005000        10 C-SA-BILL-RDL-WRITTEN PIC X(4)
005100                                 VALUE '1224' .
      *    存折书面挂失结清
              10 C-SA-PSBK-SDL-WRITTEN PIC X(4)
                                       VALUE '1322' .
      *    磁条重建
              10 C-SA-RCVRY-MAGNET     PIC X(4)
                                       VALUE '1411' .
005200*    部分冻结
005300        10 C-SA-AMT-FRZ          PIC X(4)
005400                                 VALUE '2110' .
      *    贷方冻结
              10 C-SA-CEDT-FRZ         PIC X(4)
                                       VALUE '2510'.
      *    贷方冻结
              10 C-SA-CEDT-UNFRZ         PIC X(4)
                                       VALUE '2520'.
005500*    全部冻结
005600        10 C-SA-ACC-FRZ          PIC X(4)
005700                                 VALUE '2120' .
005500*    圈存冻结
005600        10 C-SA-CIR-FRZ          PIC X(4)
005700                                 VALUE '2130'.
      *    保证金冻结
              10 C-SA-GRT-FRZ          PIC X(4)
                                       VALUE '2180'.
      *    存款证明冻结
              10 C-SA-CTF-FRZ          PIC X(4)
                                       VALUE '2190'.
005800*    部分解冻
005900        10 C-SA-AMT-UNFRZ        PIC X(4)
006000                                 VALUE '2210'.
006100*    解冻
006200        10 C-SA-ACC-UNFRZ        PIC X(4)
006300                                 VALUE '2220'.
006100*    圈存解冻
006200        10 C-SA-CIR-UNFRZ        PIC X(4)
006300                                 VALUE '2230'.
      *    保证金解冻
              10 C-SA-GRT-UNFRZ        PIC X(4)
                                       VALUE '2280'.
      *    存款证明解冻
              10 C-SA-CTF-UNFRZ        PIC X(4)
                                       VALUE '2290'.
      *    续冻
              10 C-SA-CONTIN-FRZ       PIC X(4)
                                       VALUE '2300'.
      *    单向冻结
              10 C-SA-UNILATERAL-FRZ   PIC X(4)
                                       VALUE '2410'.
      *    单向解冻
              10 C-SA-UNILATERAL-UNFRZ PIC X(4)
                                       VALUE '2420'.
006400*    扣押
006500        10 C-SA-AMT-DTN          PIC X(4)
006600                                 VALUE '4100'.
006700*    解除扣押
006800        10 C-SA-AMT-UNDTN        PIC X(4)
006900                                 VALUE '4200'.
007000*   授权
007100        10 C-SA-AUTH             PIC X(4)
007200                                 VALUE '5100'.
007300*   解除授权
007400        10 C-SA-RELEASE-AUTH     PIC X(4)
007500                                 VALUE '5200'.
AD0704*设置备抵帐户
AD0704        10 C-SA-SET-BD-ACCT      PIC X(4)
AD0704                                 VALUE '5300'.
AD0704*取消备抵帐户
AD0704        10 C-SA-CAN-BD-ACCT      PIC X(4)
AD0704                                 VALUE '5400'.
      *境外专户密码挂失
              10 C-SA-OVS-PSWD-DL      PIC X(4)
                                       VALUE '5510'.
      *境外专户密码重置
              10 C-SA-OVS-PSWD-RESET   PIC X(4)
                                       VALUE '5520'.
      *境外专户销户申请
              10 C-SA-OVS-CACCT-APP    PIC X(4)
                                       VALUE '5530'.
      *密码出错达到渠道最大
              10 C-SA-PSWD-CHANAL-TIMES
                                       PIC X(4)
                                       VALUE '5610'.
      *密码出错达到柜面最大
              10 C-SA-PSWD-TELLER-TIMES
                                       PIC X(4)
                                       VALUE '5620'.
      *密码出错次数清零
              10 C-SA-PSWD-RESET       PIC X(4)
                                       VALUE '5630'.
007600*没收
007700        10 C-SA-ACCD-CONFISCATE  PIC X(4)
007800                                 VALUE '6000'.
zmf   *部分没收
              10 C-SA-ACCD-CONFISCATE-PART
                                       PIC X(4)
                                       VALUE '6010'.
zmf   *上缴
              10 C-SA-ACCD-HANDIN      PIC X(4)
                                       VALUE '6100'.
zmf   *	部分上缴
              10 C-SA-ACCD-HANDIN-PART PIC X(4)
                                       VALUE '6110'.
      * ADD BY GUANCX 20090426
      * 指纹新增
              10 C-SA-FINGER-ADD       PIC X(4)
                                       VALUE '6200'.
      * 指纹取消
              10 C-SA-FINGER-CANCEL    PIC X(4)
                                       VALUE '6201'.
160323* 股权司法转让
160323        10 C-SA-JUSTICE-CHG      PIC X(4)
160323                                 VALUE '6300'.
      * 密码新增
              10 C-SA-PSWD-ADD         PIC X(4)
                                       VALUE '2011'.
      * 密码取消
              10 C-SA-PSWD-CANCEL      PIC X(4)
                                       VALUE '2014'.
      * 指纹+密码转指纹或密码
              10 C-SA-FINGER-AND-TO-OR PIC X(4)
                                       VALUE '6204'.
      * 指纹或密码转指纹+密码
              10 C-SA-FINGER-OR-TO-AND PIC X(4)
                                       VALUE '6205'.
      * 作废指纹
              10 C-SA-FINGER-DISAB     PIC X(4)
                                       VALUE '6206'.
      * END
007900*过户
008000        10 C-SA-TRANSFER         PIC X(4)
008100                                 VALUE '7000'.
      *设置为只收不付
              10  C-SA-RCV-NO-PAY-SET  PIC X(4)
                                       VALUE '8110'.
      *设置为只付不收
              10  C-SA-PAY-NO-RCV-SET  PIC X(4)
                                       VALUE '8210'.
      *设置为封存
              10  C-SA-LOCK-SET        PIC X(4)
                                       VALUE '8310'.
      *解除只收不付
              10  C-SA-RCV-NO-PAY-FREE PIC X(4)
                                       VALUE '8100'.
      *解除只付不收
              10  C-SA-PAY-NO-RCV-FREE PIC X(4)
                                       VALUE '8200'.
      *解除封存
              10  C-SA-LOCK-FREE       PIC X(4)
                                       VALUE '8300'.
      *正常转待睡眠
              10  C-SA-NORMAL-TO-PRE   PIC X(4)
                                       VALUE '8410'.
      *待睡眠转睡眠
              10  C-SA-PRE-TO-SLEEP    PIC X(4)
                                       VALUE '8420'.
      *睡眠转营业外收入
              10  C-SA-SLEEP-TO-OUT    PIC X(4)
                                       VALUE '8430'.
      *睡眠转正常
              10  C-SA-SLEEP-TO-NORMAL PIC X(4)
                                       VALUE '8440'.
      *营业外转正常
              10  C-SA-OUT-TO-NORMAL   PIC X(4)
                                       VALUE '8445'.
      *待睡眠转正常
              10  C-SA-PRE-TO-NORMAL   PIC X(4)
                                       VALUE '8450'.
      *睡眠转待审批
              10  C-SA-SLEEP-TO-PREA   PIC X(4)
                                       VALUE '8460'.
      *待睡眠转待审批
              10  C-SA-PRE-TO-PREA     PIC X(4)
                                       VALUE '8461'.
      *营业外转待审批
              10  C-SA-OUT-TO-PREA     PIC X(4)
                                       VALUE '8465'.
      *睡眠审批通过
              10  C-SA-PREA-TO-APPROVE PIC X(4)
                                       VALUE '8470'.
      *待睡眠审批通过
              10  C-SA-PRE-PREA-TO-APPROVE PIC X(4)
                                       VALUE '8471'.
      *营业外审批通过
              10  C-SA-OUT-PREA-TO-APPROVE PIC X(4)
                                       VALUE '8475'.
      *睡眠审批不通过
              10  C-SA-PREA-TO-SLEEP   PIC X(4)
                                       VALUE '8480'.
      *待睡眠审批不通过
              10  C-SA-PREA-TO-PRE     PIC X(4)
                                       VALUE '8481'.
      *营业外审批不通过
              10  C-SA-PREA-TO-OUT     PIC X(4)
                                       VALUE '8485'.
      *正常转睡眠　　　
              10  C-SA-NOR-TO-SLEEP    PIC X(4)
                                       VALUE '8510'.
      *对私转营业外　　　　
              10  C-SA-NOR-TO-OUT      PIC X(4)
                                       VALUE '8520'.
      *修改积数
              10  C-SA-CHG-PDT         PIC X(4)
                                       VALUE '9001'.
      *科目调整
              10  C-SA-CHG-LG          PIC X(4)
                                       VALUE '9002'.
      *透支科目调整
              10  C-SA-CHG-OD-LG       PIC X(4)
                                       VALUE '9003'.
      *客户名称修改
              10  C-SA-CHG-CUST-NAME   PIC X(4)
                                       VALUE '9011'.
      *帐户性质修改
              10  C-SA-CHG-ACCT-CHAR   PIC X(4)
                                       VALUE '9012'.
      *企业代码修改
              10  C-SA-CHG-ENTR-CODE   PIC X(4)
                                       VALUE '9013'.
      *帐户挂入综合理财
              10  C-SA-IN-TO-FS-ACCT   PIC X(4)
                                       VALUE '9020'.
      *帐户挂出综合理财
              10  C-SA-OUT-FRM-FS-ACCT PIC X(4)
                                       VALUE '9021'.
      *换折
              10  C-SA-CHG-PSBK        PIC X(4)
                                       VALUE '9014'.
      *通兑修改
              10  C-SA-CHG-DP-DW       PIC X(4)
                                       VALUE '9015'.
      *资本金限额新增
              10  C-SA-HIGH-AMT-ADD    PIC X(4)
                                       VALUE '9016'.
      *资本金限额修改
              10  C-SA-HIGH-AMT-CHG    PIC X(4)
                                       VALUE '9017'.
      *计息标志修改
              10  C-SA-INTC-FLG-CHG    PIC X(4)
                                       VALUE '9018'.
180724*同业账户用途修改
              10  C-SA-USE-CODE-CHG    PIC X(4)
                                       VALUE '9019'.
      *帐户无折转有折　
              10  C-SA-NOPSBK-TO-PSBK  PIC X(4)
                                       VALUE '9022'.
      *帐户有折转无折　
              10  C-SA-PSBK-TO-NOPSBK  PIC X(4)
                                       VALUE '9023'.
      *修改通兑范围
              10  C-SA-CHG-DPDW-RANG   PIC X(4)
                                       VALUE '9024'.
      *修改利率依据
              10  C-SA-CHG-INTR-COD    PIC X(4)
                                       VALUE '9025'.
      *修改利率
              10  C-SA-CHG-INTR        PIC X(4)
                                       VALUE '9026'.
      *修改利率加减码
              10  C-SA-CHG-FLTR-FVR-SIGN
                                       PIC X(4)
                                       VALUE '9027'.
      *修改浮动范围
              10  C-SA-CHG-FLTR-FVR    PIC X(4)
                                       VALUE '9028'.
      *设置单位帐户透支
              10  C-SA-SET-COM-OD      PIC X(4)
                                       VALUE '9030'.
      *取消单位帐户透支
              10  C-SA-CAN-COM-OD      PIC X(4)
                                       VALUE '9031'.
      *暂停单位帐户透支
              10  C-SA-PAS-COM-OD      PIC X(4)
                                       VALUE '9032'.
      *恢复单位帐户透支
              10  C-SA-RST-COM-OD      PIC X(4)
                                       VALUE '9033'.
      *修改单位帐户透支
              10  C-SA-UPD-COM-OD      PIC X(4)
                                       VALUE '9034'.
      *转出
              10  C-SA-ACCT-OUT        PIC X(4)
                                       VALUE '9040'.
      *转入
              10  C-SA-ACCT-IN         PIC X(4)
                                       VALUE '9041'.
      *转出撤销
              10  C-SA-ACCT-OUT-CAN    PIC X(4)
                                       VALUE '9042'.
      *修改临时帐户失效日期
              10  C-SA-CHG-TMP-END-DT  PIC X(4)
                                       VALUE '9043'.
      *修改执行小额利率标志
              10  C-SA-CHG-LESS-INTR-FLG   PIC X(4)
                                       VALUE '9044'.
      * 修改收取小额管理费标志
              10  C-SA-CHG-MAFE-FLG    PIC X(4)
                                       VALUE '9045'.
      *签约
              10  C-SA-SIGN            PIC X(4)
                                       VALUE '9046'.
      *取消签约
              10  C-SA-CANCLE-SIGN     PIC X(4)
                                       VALUE '9047'.
      * 支付密码维护申请
              10  C-SA-CHG-DRW-TYP     PIC X(4)
                                       VALUE '9048'.
      * 支付密码撤销申请
              10  C-SA-CANCEL-DRW-APP  PIC X(4)
                                       VALUE '9049'.
      *修改通兑标志
              10  C-SA-CHG-DPDW-FLG    PIC X(4)
                                       VALUE '9050'.
      *修改免收对公维护费标志
              10  C-SA-CHG-ENT-MAFE-FLG PIC X(4)
                                       VALUE '9051'.
      *帐户性质设置
              10  C-SA-SET-ACCT-CHAR   PIC X(04)
                                       VALUE '9052'.
      *帐户性质恢复
              10  C-SA-BAK-ACCT-CHAR   PIC X(04)
                                       VALUE '9053'.
CZG+  *个人活期凭印支付方式维护
CZG+          10  C-SA-CHG-SL-DRW-TYP  PIC X(04)
CZG+                                   VALUE '9054'.
      *对公帐户欠费免除申请
              10  C-SA-OWE-NORMAL-TO-PREA PIC X(4)
                                       VALUE '9060'.
      *对公帐户欠费免除审批通过
              10  C-SA-OWE-PREA-TO-APPROVE PIC X(4)
                                       VALUE '9061'.
      *对公帐户欠费免除审批不通过
              10  C-SA-OWE-PREA-TO-NORMAL PIC X(4)
                                       VALUE '9062'.
      *对公帐户欠费免除
              10  C-SA-OWE-CANCEL      PIC X(4)
                                       VALUE '9063'.
      *账户名称修改
              10  C-SA-CHG-ACCT-NAME   PIC X(4)
                                       VALUE '9065'.
      *核身类型修改
              10  C-SA-UPD-ACCT-CHK    PIC X(4)
                                       VALUE '9066'.
      *II\III类账户升级
              10  C-SA-UPG-KIND        PIC X(4)
                                       VALUE '9067'.
      *I\II类账户降级
              10  C-SA-DEM-KIND        PIC X(4)
                                       VALUE '9068'.

      *正常利率变动
              10  C-SA-COMM-INTR-CHG   PIC X(4)
                                       VALUE '0000'.
      *协议利率变动
              10  C-SA-NGO-INTR-CHG    PIC X(4)
                                       VALUE '0001'.
      *保付总金额
              10  C-SA-ALL-GUAR        PIC X(4)
                                       VALUE '0002'.
      *利息税税率调整
              10  C-SA-TAX-TRT-CHG     PIC X(4)
                                       VALUE '0003'.
      *密码错误次数加1
              10  C-SA-PSW-ERR-TIMES-PLUS-ONE
                                       PIC X(4)
                                       VALUE '2050'.
      *密码错误次数重置为0
              10  C-SA-PSW-ERR-TIMES-SET-ZERO
                                       PIC X(4)
                                       VALUE '2051'.
120524*单位存折转支票户
120524        10  C-SA-EVT-ENT-PSBK-TO-CHK
120524                                 PIC X(4)
120524                                 VALUE '9064'.
140110*活期密码重置
140110        10  C-SA-PSWD-RESET-COD  PIC X(4)
140110                                 VALUE '1125'.
140110*印鉴挂失补发
140110        10  C-SA-REISSUE         PIC X(4)
140110                                 VALUE '1126'.
WW1125*修改账簿利率
WW1125        10 C-SA-CHG-BKHINTR      PIC X(4)
WW1125                                 VALUE '9035'.
151028*批量销户
151028        10  C-SA-BATCH-CACC      PIC X(4)
151028                                 VALUE '5531'.
160921*=== 协助有权机关登记事故 =======
160921*临时止付
160921        10  C-SA-LINCTL-CODE     PIC X(4)
160921                                 VALUE '9101'.
160921*解除临时止付
160921        10  C-SA-UNLINCTL-CODE   PIC X(4)
160921                                 VALUE '9104'.
160921*紧急止付
160921        10  C-SA-JINCTL-CODE     PIC X(4)
160921                                 VALUE '9105'.
160921*解除紧急止付
160921        10  C-SA-UNJINCTL-CODE   PIC X(4)
160921                                 VALUE '9108'.
160921*实时监控
160921        10  C-SA-SPTSPT-CODE     PIC X(4)
160921                                 VALUE '9111'.
160921*解除实时监控
160921        10  C-SA-UNSPTSPT-CODE   PIC X(4)
160921                                 VALUE '9114'.
160921*限额支付
160921        10  C-SA-CLPCLP-CODE     PIC X(4)
160921                                 VALUE '9115'.
160921*解除限额支付
160921        10  C-SA-UNCLPCLP-CODE   PIC X(4)
160921                                 VALUE '9118'.
160921*临时止付查询
160921        10  C-SA-CTL-QU-CODE     PIC X(4)
160921                                 VALUE '9120'.
160921*客服快速查询
160921        10  C-SA-INQUIRE-CODE    PIC X(4)
                                       VALUE '9130'.
      *单位账户核算关系维护
              10  C-SA-CHG-ACCT-RELAT  PIC X(4)
                                       VALUE '9140'.
      *日累计已用转入额度调增
              10  C-SA-DAILY-C-ADD-LIMIT
                                       PIC X(4)
                                       VALUE '9151'.
      *日累计已用转入额度调减
              10  C-SA-DAILY-C-REDUCE-LIMIT
                                       PIC X(4)
                                       VALUE '9152'.
      *日累计已用转出额度调增
              10  C-SA-DAILY-D-ADD-LIMIT
                                       PIC X(4)
                                       VALUE '9153'.
      *日累计已用转出额度调减
              10  C-SA-DAILY-D-REDUCE-LIMIT
                                       PIC X(4)
                                       VALUE '9154'.
      *年累计已用转入额度调增
              10  C-SA-ANNUAL-C-ADD-LIMIT
                                       PIC X(4)
                                       VALUE '9155'.
      *年累计已用转入额度调减
              10  C-SA-ANNUAL-C-REDUCE-LIMIT
                                       PIC X(4)
                                       VALUE '9156'.
      *年累计已用转出额度调增
              10  C-SA-ANNUAL-D-ADD-LIMIT
                                       PIC X(4)
                                       VALUE '9157'.
      *年累计已用转出额度调减
              10  C-SA-ANNUAL-D-REDUCE-LIMIT
                                       PIC X(4)
                                       VALUE '9158'.
      *II/III类账户绑定行内
              10  C-SA-ACCT-BIND-INNER PIC X(4)
                                       VALUE '9160'.
      *II/III类账户绑定跨行
              10  C-SA-ACCT-BIND-CROSS PIC X(4)
                                       VALUE '9161'.
      *II/III类账户解绑
              10  C-SA-ACCT-UNBIND     PIC X(4)
                                       VALUE '9162'.
      *特殊账户新增
              10  C-SA-SPC-ACCT-ADD    PIC X(4)
                                       VALUE '9170'.
      *特殊账户修改
              10  C-SA-SPC-ACCT-UPD    PIC X(4)
                                       VALUE '9171'.
      *特殊账户删除
              10  C-SA-SPC-ACCT-DEL    PIC X(4)
                                       VALUE '9172'.
      *单位账户超期解控
              10  C-SA-OVERDUE-UNLOCK  PIC X(4)
                                       VALUE '9069'.
      *单位账户超期控制
              10  C-SA-OVERDUE-LOCK    PIC X(4)
                                       VALUE '9070'.
      * 账户激活
              10  C-SA-ACCT-ACT        PIC X(4)
                                       VALUE '9071'.
      * 账户启用
              10  C-SA-ACCT-STA        PIC X(4)
                                       VALUE '9072'.                  
      * 对私账户有效期到期止付
              10  C-SA-ACCT-CLT        PIC X(4)
                                       VALUE '9300'.
      * 解除对私账户有效期到期止付
              10  C-SA-ACCT-CLT-R      PIC X(4)
                                       VALUE '9310'.

      *保付事故日期（最大日期）
          05 C-SA-ALL-GUAR-DATE        PIC X(8)
                                       VALUE '20991231'.
      *保付事故序号
          05 C-SA-ALL-GUAR-SRL-NO      PIC X(5)
                                       VALUE '00001'.
008200
008300*圈入3100
008400*圈出3200
008500*  约定机构存取标志
008600    05 C-SA-PRDS-INSTN-DPDW-FLG.
      *对私取值
008700*    通存通兑
008800        10 C-SA-FULL-DP-DW       PIC X(1)
008900                                 VALUE '1' .
009000*     定点存取
009100        10 C-SA-SPECIAL-DP-DW    PIC X(1)
009200                                 VALUE '0' .
009000*     通存不通取
009100        10 C-SA-COULD-DEP-DW     PIC X(1)
009200                                 VALUE '2' .
009000*     通取不通存
009100        10 C-SA-COULD-DRW-DW     PIC X(1)
009200                                 VALUE '3' .
SA1101*  通兑标志
              10 C-SA-DW-YES           PIC X(1)
                                       VALUE 'Y' .

              10 C-SA-DW-NO            PIC X(1)
                                       VALUE 'N' .
      *对公取值地域通兑范围
      *     全国通兑
              10 C-SA-DW-COUNTRY       PIC X(1)
                                       VALUE '1' .
      *     全省通兑
              10 C-SA-DW-PROVINCE      PIC X(1)
                                       VALUE '2' .
      *     全市通兑
              10 C-SA-DW-CITY          PIC X(1)
                                       VALUE '3' .
      * 对公取值 法人通兑范围
      *    本法人通兑
              10 C-SA-DW-LEGAL         PIC X(1)
                                       VALUE '0' .
      *    跨法人通兑
              10 C-SA-DW-OUT-LEGAL     PIC X(1)
                                       VALUE '1' .
      *     不通兑（定点取）
              10 C-SA-SPECIAL-DW       PIC X(1)
                                       VALUE '7' .
      *     县（支行）内通兑
               10 C-SA-DW-SUBBRH       PIC X(1)
                                       VALUE '8' .
      *  通存标志
              10 C-SA-DE-YES           PIC X(1)
                                       VALUE 'Y' .

              10 C-SA-DE-NO            PIC X(1)
                                       VALUE 'N' .
      *  地域通存范围
SA1101*    全国通存
              10 C-SA-DE-COUNTRY       PIC X(1)
                                       VALUE '1' .
      *     全省通存
              10 C-SA-DE-PROVINCE      PIC X(1)
                                       VALUE '2' .
      *     全市通存
              10 C-SA-DE-CITY          PIC X(1)
                                       VALUE '3' .
      * 对公取值 法人通兑范围
      *    本法人通存
              10 C-SA-DE-LEGAL         PIC X(1)
                                       VALUE '0' .
      *    跨法人通存
              10 C-SA-DE-OUT-LEGAL     PIC X(1)
                                       VALUE '1' .
      *    不通兑（定点取）
              10 C-SA-SPECIAL-DE       PIC X(1)
                                       VALUE '7'.
SA1101*
009300*     寄对帐单标志
009400    05 C-SA-MBSTMT-FLG.
009500*     寄对帐单
009600        10 C-SA-MBSTMT           PIC X(1)
009700                                 VALUE 'Y' .
009800*     不寄对帐单
009900        10 C-SA-NON-MBSTMT       PIC X(1)
010000                                 VALUE 'N' .
010100*     存折状态
010200
010300    05 C-SA-PSBK-STS.
010400*     无折
010500        10 C-SA-NON-PSBK         PIC X(1)
010600                                 VALUE '0' .
010700*     有折已发
010800        10 C-SA-HANDOUT-PSBK     PIC X(1)
010900                                 VALUE '1' .
011000*     有折未发
011100        10 C-SA-NOT-HANDOUT-PSBK PIC X(1)
011200                                 VALUE '2' .
011300*     存折口头挂失
011400        10 C-SA-PSBK-DL-WORDY    PIC X(1)
011500                                 VALUE '3' .
011600*     存折书面挂失
011700        10 C-SA-PSBK-DL-WRITTEN  PIC X(1)
011800                                 VALUE '4' .
      *     存折补设待生效
              10 C-SA-PSBK-PRE-APPROVE PIC X(1)
                                       VALUE '5' .
011900*交易类别   见PCMCONST
012000*   05 C-SA-TX-TYP.
012100*     现金
012200*       10 C-SA-CASH-COD         PIC X(1)
012300*                                VALUE '1' .
012400*     转帐
012500*       10 C-SA-TRF-COD          PIC X(1)
012600*                               VALUE '2' .
012700*     交换提出
012800*       10 C-SA-CLRG-COD         PIC X(1)
012900*                                VALUE '3' .
013000*     交换收妥
013100*       10 C-SA-CLRG-COLLC-COD   PIC X(1)
013200*                                VALUE '8' .
013300*     汇划
013400*       10 C-SA-TRN-COD          PIC X(1)
013500*                               VALUE '4'.
013600*结息方式
013700    05 C-SA-CLSD-INTC-SA-TYP.
013800*     不结息
013900        10 C-SA-N-INT-CAL        PIC X(1)
014000                                 VALUE '0' .
014100*     月结息
014200        10 C-SA-INT-CAL-MONTHLY  PIC X(1)
014300                                 VALUE '1' .
014400*     季结息
014500        10 C-SA-INT-CAL-SSN      PIC X(1)
014600                                 VALUE '2' .
014700*     年结息
014800        10 C-SA-INT-CAL-YEARLY   PIC X(1)
014900                                 VALUE '4' .
015000*     半年结息
015100        10 C-SA-INT-CAL-HALF-YEAR PIC X(1)
015200                                 VALUE '3'.
015000*     日结息
015100        10 C-SA-INT-CAL-DAYLY    PIC X(1)
015200                                 VALUE '5'.
015000*     周结息
015100        10 C-SA-INT-CAL-WEEKLY    PIC X(1)
015200                                 VALUE '6'.
015000*     销户结息
015100        10 C-SA-INT-CAL-CANCEL      PIC X(1)
015200                                 VALUE '7'.
015300*     钞汇鉴别
015400*     05 C-SA-CURR-IDEN.
015500*     钞  见 C-CM-CASH-ID OF PCMCONST
015600*        10 C-SA-CURRENCY         PIC X(1)
015700*                                 VALUE '0'.
015800*     汇  见 C-CM-EXC-ID OF PCMCONST
015900*        10 C-SA-DD               PIC X(1)
016000*                                 VALUE '1'.
016100*      钞汇属性 OF SAACNACN
016200     05 C-SA-CURR-TYP.
016300*      甲-对公
016400        10 C-SA-PUB              PIC X(1)
016500                                 VALUE '0'.
016600*       乙-境外人士
016700        10 C-SA-OVERSEAS-CHINESE PIC X(1)
016800                                 VALUE '1'.
016900*       丙-对私
016700        10 C-SA-PRI              PIC X(1)
017100                                 VALUE '2'.
017200*钞汇鉴别
017300*    05 C-SA-CURR-IDEN.
017400*     甲钞
017500*        10 C-SA-A-CURRENCY       PIC X(1)
017600*                                 VALUE '5' .
017700*     甲汇
017800*        10 C-SA-A-DD             PIC X(1)
017900*                                 VALUE '6' .
018000*     乙钞
018100*        10 C-SA-B-CURRENCY       PIC X(1)
018200*                                 VALUE '1' .
018300*     乙汇
018400*        10 C-SA-B-DD             PIC X(1)
018500*                                 VALUE '2' .
018600*     丙钞
018700*        10 C-SA-C-CURRENCY       PIC X(1)
018800*                                 VALUE '3' .
018900*     丙汇
019000*        10 C-SA-C-DD             PIC X(1)
019100*                                 VALUE '4' .
019200*密码状态
019300    05 C-SA-PWD-STS.
019400*     无密码
019500        10 C-SA-NON-PWD          PIC X(1)
019600                                 VALUE '0' .
019700*     有密码
019800        10 C-SA-PWD              PIC X(1)
019900                                 VALUE '1' .
020000*     密码口头挂失
020100        10 C-SA-PWD-DL-WORDY     PIC X(1)
020200                                 VALUE '3' .
020300*     密码书面挂失
020400        10 C-SA-PWD-DL-WRITTEN   PIC X(1)
020500                                 VALUE '4' .
      *     密码补设待生效
              10 C-SA-PWD-PRE-APPROVE  PIC X(1)
                                       VALUE '5' .
020600*印鉴状态
020700    05 C-SA-SL-STS.
020800*     无印鉴
020900        10 C-SA-NON-SL           PIC X(1)
021000                                 VALUE '0' .
021100*     有印鉴
021200        10 C-SA-SL               PIC X(1)
021300                                 VALUE '1' .
021400*     印鉴口头挂失
021500        10 C-SA-SL-DL-WORDY      PIC X(1)
021600                                 VALUE '3' .
021700*     印鉴书面挂失
021800        10 C-SA-SL-DL-WRITTEN    PIC X(1)
021900                                 VALUE '4' .
022000*支取方式
022100    05 C-SA-DRW-TYP.
022200*     凭存折
022300        10 C-SA-DRW-BY-PSBK      PIC X(1)
022400                                 VALUE '1' .
022500*     凭身份证
022600        10 C-SA-DRW-BY-ID-CARD   PIC X(1)
022700                                 VALUE '1'.
022800*     凭印鉴
022900        10 C-SA-DRW-BY-SL        PIC X(1)
023000                                 VALUE '1'.
023100*     凭密码
023200        10 C-SA-DRW-BY-PWD       PIC X(1)
023300                                 VALUE '1'.
023400*     不凭存折
023500        10 C-SA-DRW-BY-PSBK-N   PIC X(1)
023600                                 VALUE '0' .
023700*    不 凭身份证
023800        10 C-SA-DRW-BY-ID-CARD-N PIC X(1)
023900                                 VALUE '0'.
024000*     不凭印鉴
024100        10 C-SA-DRW-BY-SL-N      PIC X(1)
024200                                 VALUE '0'.
024300*     不凭密码
024400        10 C-SA-DRW-BY-PWD-N     PIC X(1)
024500                                 VALUE '0'.
      *      支付密码
              10 C-SA-DRW-PAY-PSWD     PIC X(1)
                                       VALUE '2'.
      *      凭密码信封
              10 C-SA-DRW-HEAD-PAY-PSWD PIC X(1)
                                       VALUE '3'.
      *      总行支付密码（待启用）
              10 C-SA-DRW-HEAD-PAY-PSWD-W PIC X(1)
                                       VALUE '4'.
      *      总行支付密码（待停用）
              10 C-SA-DRW-HEAD-PAY-PSWD-N PIC X(1)
                                       VALUE '5'.
      *      凭指纹
              10 C-SA-DRW-BY-FINGER    PIC X(1)
                                       VALUE 'A'.
      *      凭指纹和密码
              10 C-SA-DRW-BY-FGR-AND-PWD PIC X(1)
                                       VALUE 'B'.
      *      凭指纹或密码
              10 C-SA-DRW-BY-FGR-OR-PWD PIC X(1)
                                       VALUE 'C'.
      *      仅凭密码
              10 C-SA-DRW-BY-PWD-ONLY  PIC X(4)
                                       VALUE '0001'.
      *      仅凭印鉴
              10 C-SA-DRW-BY-SL-ONLY   PIC X(4)
                                       VALUE '0010'.

024600*帐号状态
024700    05 C-SA-DDP-ACCT-STS.
024800*     正常
024900        10 C-SA-NORMAL-COD       PIC X(1)
025000                                 VALUE '0'.
025100*     销户
025200        10 C-SA-CANCEL-COD       PIC X(1)
025300                                 VALUE '1'.
025400*     冻结
025500        10 C-SA-FRZ-COD          PIC X(1)
025600                                 VALUE '2'.
025700*     结清
025800        10 C-SA-CLOSED-COD       PIC X(1)
025900                                 VALUE '3'.
026000*     交换未收妥
026100        10 C-SA-CLRG-NOT-COLLC-COD   PIC X(1)
026200                                 VALUE '4'.
026300*     帐号不存在
026400        10 C-SA-NOT-EXIST-COD    PIC X(1)
026500                                 VALUE '5'.
      *     贷方冻结
              10 C-SA-CREDIT-FRZ       PIC X(1)
                                       VALUE '6'.
026600*     单向冻结
026700        10 C-SA-FRZ-UNILATERAL-COD   PIC X(1)
026800                                 VALUE '7'.
026600*     部分冻结
026700        10 C-SA-FRZ-AMT-COD      PIC X(1)
026800                                 VALUE '8'.
026900*     无效
027000        10 C-SA-INVALID-COD      PIC X(1)
027100                                 VALUE '9'.
027200*     冲正
027300        10 C-SA-REVERSE-COD      PIC X(1)
027400                                 VALUE 'A'.
027500*计息方式
027600    05 C-SA-INTC-SA-TYP.
027700*     不分段
027800        10 C-SA-UNDIVIDE-COD     PIC X(1)
027900                                 VALUE '1'.
028000*     按实际利率分段
028100        10 C-SA-DIVIDE-COD       PIC X(1)
028200                                 VALUE '2'.
028300*     就高不就低分段
028400        10 C-SA-SPEC-SA-DIVIDE-COD PIC X(1)
028500                                 VALUE '3'.
028600*帐户性质
028700    05 C-SA-ACC-SA-CHAR.
028800*     无效性质
028900        10 C-SA-INVALID-CHAR     PIC X(1)
029000                                 VALUE '0'.
029100*     第一位
029200        10 C-SA-POS-ONE.
029300*     RMB帐户
029400            15 C-SA-RMB-ACC      PIC X(1)
029500                                 VALUE '1'.
029600*     外币帐户
029700            15 C-SA-FCURR-ACC    PIC X(1)
029800                                 VALUE '2'.
029900*     第二位
030000        10 C-SA-POS-TWO.
030100*     基本帐户
030200            15 C-SA-BASIC-SA-ACC PIC X(1)
030300                                 VALUE '1'.
030400*     一般帐户
030500            15 C-SA-NORMAL-ACC   PIC X(1)
030600                                 VALUE '2'.
030700*     专用帐户
030800            15 C-SA-SPEC-ACC     PIC X(1)
030900                                 VALUE '3'.
031000*     临时帐户
031100            15 C-SA-TEMP-ACC     PIC X(1)
031200                                 VALUE '4'.
SA1101*     委贷基金
SA1101            15 C-SA-LOAN-ACC    PIC X(1)
SA1101                                  VALUE '9'.
SA1101* 外管账户性质
          05 C-SA-FX-ACCT-CHAR.
SA1101*        无效性质
SA1101        10 C-SA-FX-INVALID-CHAR     PIC X(1)
SA1101                                 VALUE '0'.
SA1101*     第一位
SA1101        10 C-SA-FX-POS-ONE.
SA1101*     非资本项
SA1101            15 C-SA-FX-ACC      PIC X(1)
SA1101                                 VALUE '1'.
SA1101*     资本项目
029700            15 C-SA-CAP-ACC    PIC X(1)
029800                                 VALUE '2'.
      *    资本项目-人民币前期费用专用存款账户
              10 C-SA-CAP-SAP-FEE      PIC X(4)
                                       VALUE '2108'.
      *    资本项目-前期费用外汇账户
              10 C-SA-CAP-FX-FEE       PIC X(4)
                                       VALUE '2101'.
SA1101*  账户启用状态
          05 C-ACCT-STA-STS.
SA1101*  已启用
              10  C-SA-STA-YES         PIC X(1)
SA1101                                 VALUE '0'.
SA1101*  未启用
              10  C-SA-STA-NO         PIC X(1)
SA1101                                 VALUE '1'.
      *  注销
              10  C-SA-CAN-RES         PIC X(1)
                                       VALUE '2'.
SA1101*  账户年检状态
          05 C-ACCT-CHK-FLG.
SA1101*  已年检
              10  C-SA-CHK-YES         PIC X(1)
SA1101                                 VALUE '1'.
SA1101*   未年检
              10  C-SA-CHK-NO         PIC X(1)
SA1101                                 VALUE '2'.
031300*开户方式,
031400    05 C-SA-OPEN-MODE .
031500*     单件开户时一本通不可零开户
031600        10 C-SA-SINGLE-COD       PIC X(1)
031700                                 VALUE '0'.
031800*     批量开户一本通开户可以零开户
031900        10 C-SA-BATCH-COD        PIC X(1)
032000                                 VALUE '1'.
032100
032200*支取标志
032300    05 C-SA-DRW-FLG.
032400*     未授权交易, 需CHECK 支取方式
032500        10 C-SA-NON-AUTH-MOD     PIC X(1)
032600                                 VALUE '0'.
032700*     授权交易, 无需CHECK 支取方式
032800        10 C-SA-AUTH-MOD         PIC X(1)
032900                                 VALUE '1'.
032700*     支取交易  FOR KSATXN1
032800        10 C-SA-DRW-MOD         PIC X(1)
032900                                 VALUE '2'.
032700*     存入交易  FOR KSATXN1
032800        10 C-SA-DEP-MOD         PIC X(1)
032900                                 VALUE '3'.
033000*计息标志,PKSACLO1功能见PCMCONST
033100*   05 C-SA-INTC-SA-FLG.
033200*     不计息
033300*       10 C-SA-NON-INTEREST-MOD PIC X(1)
033400*                                VALUE 'N'.
033500*     计息
033600*       10 C-SA-INTEREST-MOD     PIC X(1)
033700*                                VALUE 'Y'.
033800*ATM标志-实际含义应为交易发生地
033900    05 C-SA-ATM-FLG.
034000*     ATM交易
034100        10 C-SA-ATM-TX           PIC X(1)
034200                                 VALUE 'Y'.
034300*     柜台交易
034400        10 C-SA-NON-ATM-TX       PIC X(1)
034500                                 VALUE 'N'.
034600*     POS/商户授权消费
034700        10 C-SA-POS-TX           PIC X(1)
034800                                 VALUE 'P'.
034900*冲正标志见PCMCONST
035000*   05 C-SA-EC-SA-FLG.
035100*     正常
035200*       10 C-SA-NORMAL-MOD       PIC X(1)
035300*                                VALUE '0'.
035400*     冲正
035500*       10 C-SA-REVERSE-MOD      PIC X(1)
035600*                                VALUE '1'.
035700*     被冲正
035800*       10 C-SA-REVERSED-MOD     PIC X(1)
035900*                                VALUE '2'.
036000*是否允许透支结清
036100    05 C-SA-IFTOUQING.
036200*     允许透支金额>0时结清
036300        10 C-SA-OD-CLOSE         PIC X(1)
036400                                 VALUE 'Y'.
036500*     不允许透支结清
036600        10 C-SA-NON-OD-CLOSE     PIC X(1)
036700                                 VALUE 'N'.
036800*透支标志
036900    05 C-SA-OD-SIGN.
037000*     不透支
037100        10 C-SA-NOT-OD           PIC X(1)
037200                                 VALUE '0'.
037300*     限额内透支
037400        10 C-SA-OD-LIMITED       PIC X(1)
037500                                 VALUE '1'.
037600*     允许透支超过最高透支限额
037700        10 C-SA-OD-UNLIMITED     PIC X(1)
037800                                 VALUE '2'.
037900*   CSAQRY1 功能选择I-CHECK-FUNC
038000    05 C-SA-CHECK-FUNC.
038100*     约定转存检查
038200        10 C-SA-TRND-CHK         PIC X(1)
038300                                 VALUE '1'.
038400*     存入检查
038500        10 C-SA-DEP-CHK          PIC X(1)
038600                                 VALUE '2'.
038700*     不可透支支取检查
038800        10 C-SA-NON-OD-DRW-CHK   PIC X(1)
038900                                 VALUE '3'.
039000*     限额透支检查
039100        10 C-SA-LIMITED-OD-DRW-CHK   PIC X(1)
039200                                 VALUE '4'.
039300*     无限额透支
039400        10 C-SA-UNLIMITED-OD-DRW-CHK PIC X(1)
039500                                 VALUE '5'.
039600*     结清
039700        10 C-SA-CLOSED-CHK       PIC X(1)
039800                                 VALUE '6'.
039900*     销户
040000        10 C-SA-CANCEL-CHK       PIC X(1)
040100                                 VALUE '7'.
040200*     开户冲正
040300        10 C-SA-OPEN-EC-CHK      PIC X(1)
040400                                 VALUE '8'.
      *    CSAQRY1 功能选择I-DPDW-CHK
        05 C-SA-DPDW-CHCK.
      *       通存检查
               10 C-SA-DP-CHK          PIC X(1)
                                        VALUE '0'.
      *       通兑检查
               10 C-SA-DW-CHK          PIC X(1)
                                        VALUE '1'.
      *       两者都检查
               10 C-SA-DPDW-CHK        PIC X(1)
                                        VALUE '2'.
      *       两者都不检查
               10 C-SA-DPDW-NO-CHK     PIC X(1)
                                        VALUE '3'.

       05 C-SA-YES                     PIC X(1)
                                       VALUE 'Y'.
       05 C-SA-NO                      PIC X(1)
                                       VALUE 'N'.
       05 C-SA-TRUE                    PIC X(1)
                                       VALUE '1'.
       05 C-SA-FALSE                   PIC X(1)
                                       VALUE '0'.
041400*   摘要代码见PCMCONST
041500*   05 C-SA-DSCRP-COD.
041600*      现金开户
041700*       10 C-SA-CSH-ACN          PIC X(4)
041800*                                VALUE '0001'.
041900*       现金续存
042000*       10 C-SA-CSH-DEP          PIC X(4)
042100*                                VALUE '0002'.
042200*       现金销户
042300*       10 C-SA-CSH-CANCEL       PIC X(4)
042400*                                VALUE '0003'.
042500*       现金续取
042600*       10 C-SA-CSH-DRW          PIC X(4)
042700*                                VALUE '0004'.
042800*       转帐开户
042900*       10 C-SA-TRF-ACN          PIC X(4)
043000*                                VALUE '0005'.
043100*       转帐存款
043200*       10 C-SA-TRF-DEP          PIC X(4)
043300*                                VALUE '0006'.
043400*       转帐销户
043500*       10 C-SA-TRF-CANCEL       PIC X(4)
043600*                                VALUE '0007'.
043700*       转帐取款
043800*       10 C-SA-TRF-DRW          PIC X(4)
043900*                                VALUE '0008'.
044000*       冲正
044100*       10 C-SA-REVERSE          PIC X(4)
044200*                                VALUE '0009'.
044300*       补登存折
044400*       10 C-SA-GET-PSBK         PIC X(4)
044500*                                VALUE '0010'.
044600*       换折
044700*       10 C-SA-REPLACE-PSBK     PIC X(4)
044800*                                VALUE '0011'.
044900*       结息
045000*       10 C-SA-INTC             PIC X(4)
045100*                                VALUE '0012'.
045200*       还透支息
045300*       10 C-SA-REFUND-OD-INT    PIC X(4)
045400*                                VALUE '0013'.
045500*       还透支
045600*       10 C-SA-REFUND-OD        PIC X(4)
045700*                                VALUE '0014'.
045800*       手续费
045900*       10 C-SA-DEDUCT-POUNDAGE  PIC X(4)
046000*                                VALUE '0015'.
046100*       过户
046200*       10 C-SA-TRANSFER-DESC    PIC X(4)
046300*                                VALUE '0016'.
046400*       没收
046500*       10 C-SA-CONFISCATE-DESC  PIC X(4)
046600*                                VALUE '0017'.
046700*   CCMACC6 :O-CORPPRVT-FLAG 对私 / 对公标志
046800    05 C-SA-CORPPRVT-FLAG.
046900*       2 =  对公
047000        10 C-SA-PUB-FLG          PIC X(1)
047100                                 VALUE '2'.
047200*       1 = 对私
047300        10 C-SA-PRI-FLG          PIC X(1)
047400                                 VALUE '1'.
047500*   O-ACCT-FEA-FLG  1= 一本通标志
047600    05 C-SA-ACC-FEA-FLG.
047700*
047800        10 C-SA-ACC-FEA-FLG-COM  PIC X(1)
047900                                 VALUE '0'.
048000
048100        10 C-SA-ACC-FEA-FLG-MUL  PIC X(1)
048200                                 VALUE '1'.
048300*     信用卡
048400        10 C-SA-ACC-CREDIT-CARD  PIC X(1)
048500                                 VALUE '2'.
      *对公信用卡
071000       10 C-SA-COM-CREDIT-CARD   PIC X(1) VALUE '3'.
071100*对私信用卡
071200       10 C-SA-PRI-CREDIT-CARD   PIC X(1) VALUE '4'.
071500*对公储蓄卡
071600       10 C-SA-COM-DEPOSIT-CARD  PIC X(1) VALUE '5'.
071700*对私储蓄卡
071800       10 C-SA-PRI-DEPOSIT-CARD  PIC X(1) VALUE '6'.
071500*对公贷记卡
071600       10 C-SA-COM-LOAN-CARD     PIC X(1) VALUE '7'.
071700*对私贷记卡
071800       10 C-SA-PRI-LOAN-CARD     PIC X(1) VALUE '8'.
      *对私IC卡
             10 C-SA-PRI-IC-CARD       PIC X(1) VALUE '9'.
      *对公IC卡
             10 C-SA-COM-IC-CARD       PIC X(1) VALUE 'A'.

048600*   QUERY FUNC CODE ,查询功能号
048700    05 C-SA-QUERY-FUNC-COD.
048800*      获取第一个
048900       10 C-SA-GET-FIRST         PIC X(1)
049000                                 VALUE '0'.
049100*      获取特定记录
049200       10 C-SA-GET-SPECIFIC      PIC X(1)
049300                                 VALUE '1'.
049400*      获取下一个
049500       10 C-SA-GET-NEXT          PIC X(1)
049600                                 VALUE '2'.
049700*      交易类型见PCMCONST
049800*   05 C-SA-SYS-TX-TYP.
049900*      正常交易
050000*      10  C-SA-NORMAL-TX        PIC X(1)
050100*                                VALUE '0'.
050200*      冲正交易
050300*      10  C-SA-REVERSE-TX       PIC X(1)
050400*                                VALUE '1'.
050500*    CSAAUT0功能号
050600    05 C-SA-FUNC-CODE-OF-CSAAUT0.
050700*   授权
050800       10 C-SA-AUTH              PIC X(1)
050900                                 VALUE '0'.
051000*解除授权
051100       10 C-SA-REL-AUTH          PIC X(1)
051200                                 VALUE '1'.
051300*    约定转存功能
051400*   05 C-SA-TRM0-FUNC.
051500*     新增
051600*       10  C-SA-TRM0-INSERT     PIC X(1)
051700*                                VALUE '1'.
051800*     删除
051900*
052000*       10  C-SA-TRM0-DELETE     PIC X(1)
052100*                                VALUE '2'.
052200*     修改
052300*       10  C-SA-TRM0-UPDATE     PIC X(1)
052400*                                VALUE '3'.
052500*     查询
052600*       10  C-SA-TRM0-GET-UNIQ   PIC X(1)
052700*                                VALUE '4'.
052800*     查询修改
052900*       10  C-SA-TRM0-GET-HOLD   PIC X(1)
053000*                                VALUE '5'.
053100*CSALMT0 功能号
053200    05 C-SA-LMT-FUNC-CODE.
053300*      存入
053400        10  C-SA-LMT-DEP         PIC X(1)
053500                                 VALUE '0'.
053600*      支取
053700        10  C-SA-LMT-DRW         PIC X(1)
053800                                 VALUE '1'.
053900*      冲正
054000        10  C-SA-LMT-REVERSE     PIC X(1)
054100                                 VALUE '2'.
054200*    帐号类型(SACHK0请用C-SA-TRUE 和C-SA-FALSE)
054300*    此处的帐号类型用于CSAAMT4
054400    05 C-SA-ACCT-TYP-OF-CSAAMT4.
054500*        活期帐号
054600        10 C-SA-SA-TYP           PIC X(1)
054700                                 VALUE '1'.
054800*        定期帐号
054900        10 C-SA-TD-TYP           PIC X(1)
055000                                 VALUE '2'.
055100*        其他帐号
055200        10 C-SA-OTHER-TYP        PIC X(1)
055300                                 VALUE '3'.
055400*        计息类别I-INTC-TYPE  OF CSAINF0
055500*   05 C-SA-INTC-TYPE.
055600*       实际天数
055700*       10 C-SA-REAL-DAY         PIC X(1)
055800*                                VALUE '2'.
055900*       360天/年
056000*       10 C-SA-ACC-DAY          PIC X(1)
056100*                                VALUE '1'.
056200*  利率种类
056300    05 C-SA-INTR-TYP .
056400*       储蓄(???暂定)
056500        10 C-SA-PSN-INTR         PIC X(2)
056600                                 VALUE 'S2'.
056700*RMB 钞汇鉴别
056800    05 C-SA-RMB-CURR-IDEN        PIC X(1)
056900                                 VALUE '0'.
057000*信用卡标志
057100    05 C-SA-CREDIT-CARD-FLG.
057200*信用卡
057300       10 C-SA-CREDIT-CARD       PIC X(1)
057400                                 VALUE 'C'.
057500*储蓄卡
057600       10 C-SA-DEPOSIT-CARD      PIC X(1)
057700                                 VALUE 'D'.
057800*存折户
057900       10 C-SA-PSBK-ACCT         PIC X(1)
058000                                 VALUE 'P'.
058100*CONDITION TABLE FO ACCOUNTING RULE  , SVC
058200   05 C-SA-SVC-STS.
058300*SVC >0    N 7<  >0
058400       10 C-SA-SVC-EXIST         PIC X(1)
058500                                 VALUE '0'.
058600       10 C-SA-NONE-SVC          PIC X(1)
058700                                 VALUE '1'.
058800*冻结解冻KB的功能号定义见PCMCONST
058900*  05 C-SA-FUNC-CODE-OF-KSAAFR0.
059000*冻结
059100*      10 C-SA-FRZ               PIC X(1)
059200*                                VALUE '1'.
059300*部分冻结
059400*      10 C-SA-PAR-FRZ           PIC X(1)
059500*                                VALUE '2'.
059600*解冻
059700*      10 C-SA-RLS-FRZ           PIC X(1)
059800*                                VALUE '3'.
059900*部分解冻
060000*      10 C-SA-RLS-PAR-FRZ       PIC X(1)
060100*                                VALUE '4'.
060200*扣押
060300*      10 C-SA-RTN               PIC X(1)
060400*                                VALUE '5'.
060500*解除扣押
060600*      10 C-SA-RLS-RTN           PIC X(1)
060700*                                VALUE '6'.
060800*活期KB REQUESTOR中的常量
060900   05 C-SA-CONST-OF-KBSA.
061000*帐户余额由透支转为不透支标志,如果非
061100*此种情况, 该值置空
061200       10 C-SA-OD-NONOD-FLG      PIC X(1)
061300                                 VALUE '0'.
061400*手续费收取方式-集中,分散
061500   05 C-SA-STLM-SVC-STY.
061600*分散收取
061700       10 C-SA-STLM-SVC-STY-DIV  PIC X(1)
061800                                 VALUE '1'.
061900*集中收取
062000       10 C-SA-STLM-SVC-STY-SUM  PIC X(1)
062100                                 VALUE '0'.
062200*利息清单标志
062300   05 C-SA-INT-LIST-FLG.
062400*不打印利息清单
062500       10 C-SA-UNPRT-LIST        PIC X(1)
062600                                 VALUE 'N'.
062700*打印利息清单
062800       10 C-SA-PRT-LIST          PIC X(1)
062900                                 VALUE 'Y'.
063000*入帐标志,一本通或一般存入交换提出
063100*见 PRECONST 0- 可直接入帐； 1- 需托收后入帐
063200*   05 C-SA-UPD-FLG.
063300*入帐
063400*       10 C-SA-ACCOUNT-BEING-MADE
063500*                                 PIC X(1)
063600*                                 VALUE 'Y'.
063700*不入帐
063800*       10 C-SA-OFF-STATEMENT     PIC X(1)
063900*                                 VALUE 'N'.
064000*换折标志
064100   05 C-SA-REPLACE-PSBK-FLG.
064200*不换折
064300       10 C-SA-NOT-REPLACE-PSBK  PIC X(1)
064400                                 VALUE '0'.
064500*换折
064600       10 C-SA-REPLACE-PSBK      PIC X(1)
064700                                 VALUE '1'.
064800*查询打印功能, 使用者 P5131
064900   05 C-SA-QUERY-PRINT-FUNC.
065000*查询
065100       10 C-SA-QUERY-COD         PIC X(1)
065200                                 VALUE '1'.
065300*打印
065400       10 C-SA-PRINT-C0D         PIC X(1)
065500                                 VALUE '2'.
065600*存折维护功能号 OF 1043
065700   05 C-SA-OF-1043.
065800*换新折,
065900       10 C-SA-GET-NEW-PSBK      PIC X(1) VALUE '1'.
066000*挂失补发
066100       10 C-SA-LOSS-APPEND-PSBK  PIC X(1) VALUE '2'.
066200*损毁补发
066300       10 C-SA-OLD-APPEND-PSBK   PIC X(1) VALUE '3'.
066400*重建磁条
066500       10 C-SA-RECOVER-MAGNET    PIC X(1) VALUE '4'.
066600*无折转有折
066700       10 C-SA-NON-TR-HAVE-PSBK  PIC X(1) VALUE '5'.
066800*工资户发折
066900       10 C-SA-SAL-PSBK          PIC X(1) VALUE '6'.
067000*书面挂失
067100       10 C-SA-DL-PSBK-WRITTEN   PIC X(1) VALUE '7'.
067200*口头挂失
067300       10 C-SA-DL-PSBK-WORDY     PIC X(1) VALUE '8'.
      *口头长期挂失
             10  C-SA-DL-PSBK-WORDYS   PIC X(1) VALUE 'K'.
067400*解挂
067500       10 C-SA-RDL-PSBK          PIC X(1) VALUE '9'.
      *储蓄卡收回存折
             10 C-SA-FETCH-PSBK        PIC X(1) VALUE 'A'.
      *储蓄卡发放存折
             10 C-SA-SEND-PSBK         PIC X(1) VALUE 'B'.
      *发折重置密码
             10 C-SA-PSBK-RESET-PSWD   PIC X(1) VALUE 'C'.
      *不换折打新帐号
             10 C-SA-PSBK-REPRT-ACNO   PIC X(1) VALUE 'D'.
      *存折补设生效
             10 C-SA-APPEND-ENABLE-PSBK PIC X(1) VALUE 'E'.
      *活期存单补发
             10 C-SA-REISSUE-DOCU       PIC X(1) VALUE 'F'.
      *支取方式信息打印
             10 C-SA-DRW-TYP-PRT        PIC X(1) VALUE 'G'.
      *老系统旧折换新折
             10 C-SA-OLD-TO-NEW-PSBK    PIC X(1) VALUE 'H'.
      *冲正换发
             10 C-SA-REVERSE-GHG-PSBK   PIC X(1) VALUE 'I'.
120524*单位存折户转支票户
120524       10  C-SA-ENT-PSBK-TO-CHK   PIC X(1) VALUE 'J'.
067600*补登存折标志
067700   05 C-SA-PRINT-PSBK-FLG.
067800*不补登
067900       10 C-SA-NOT-PRINT-PSBK    PIC X(1)
068000                                 VALUE '0'.
068100*补登
068200       10 C-SA-PRINT-PSBK        PIC X(1)
068300                                 VALUE '1'.
068400*换折
068500       10 C-SA-CHANGE-PSBK       PIC X(1)
068600                                 VALUE '2'.
068700*印鉴维护功能号 OF 1058
068800   05 C-SA-OF-1058.
068900*修改
069000       10 C-SA-UPDATE-SL         PIC X(1) VALUE '1'.
069100*书挂
069200       10 C-SA-DL-SL-WRITTEN     PIC X(1) VALUE '2'.
069300*新增
069400       10 C-SA-GET-NEW-SL        PIC X(1) VALUE '3'.
069500*取消
069600       10 C-SA-CANCEL-SL         PIC X(1) VALUE '4'.
069700*解挂补设
069800       10 C-SA-RDL-APPEND-SL     PIC X(1) VALUE '5'.
069900*解挂
070000       10 C-SA-RDL-SL            PIC X(1) VALUE '6'.
070100*外币付款凭证凭证种类 OF 1056
070200   05 C-SA-OF-1056.
070300*中行交换
070400       10 C-SA-CLRG-BC           PIC X(1) VALUE '1'.
070500*人行交换
070600       10 C-SA-CLRG-PBC          PIC X(1) VALUE '2'.
070700*其他子系统使用的存款种类
070800   05 C-NON-SA-DEP-TYP.
070900*对公IC卡
071000       10 C-SA-COM-DEP-IC-CARD   PIC X(2) VALUE '51'.
071100*对私IC卡
071200       10 C-SA-PRI-DEP-IC-CARD   PIC X(2) VALUE '52'.
070900*对公贷记卡-单位贷记卡准备金
071000       10 C-SA-COM-LOAN-CARD   PIC X(2) VALUE '53'.
071100*对私贷记卡-个人贷记卡准备金
071200       10 C-SA-PRI-LOAN-CARD   PIC X(2) VALUE '54'.
070900*对公信用卡-单位信用卡准备金
071000       10 C-SA-COM-CREDIT-CARD   PIC X(2) VALUE '56'.
071100*对私信用卡-个人信用卡准备金
071200       10 C-SA-PRI-CREDIT-CARD   PIC X(2) VALUE '57'.
      *外汇买卖存款种类
             10 C-SA-FCURR             PIC X(2) VALUE '19'.
071300*零时存款户(对公)-结算使用, 为应解汇款
071400       10 C-SA-TEMP-ACCT         PIC X(2) VALUE '10'.
071300*零时存款户(对私)
071400       10 C-SA-TEMP-ACCT-PRI     PIC X(2) VALUE '13'.

071500*对公储蓄卡
hugl  *      10 C-SA-COM-DEPOSIT-CARD  PIC X(2) VALUE '02'.
hugl         10 C-SA-COM-DEPOSIT-CARD  PIC X(2) VALUE '06'.
071700*对私储蓄卡
hugl  *      10 C-SA-PRI-DEPOSIT-CARD  PIC X(2) VALUE '02'.
hugl         10 C-SA-PRI-DEPOSIT-CARD  PIC X(2) VALUE '05'.
hugl         10 C-SA-PRI-YIBAO-CARD    PIC X(2) VALUE '07'.
      *活期储蓄
             10 C-SA-DEPOSIT           PIC X(2) VALUE '01'.
YUEZB *个人支票（人民币）
YUEZB        10 C-SA-PRI-CHK           PIC X(2) VALUE '34'.
ZHENGG*活期存单
ZHENGG       10 C-SA-DOCU-ACCT         PIC X(2) VALUE '00'.
      *大额存款灵活计息
             10 C-SA-LARGE-DEPOSIT     PIC X(2) VALUE '05'.
      * 房易安存款
             10 C-SA-REA-DEPOSIT       PIC X(2) VALUE '3W'.
071900*活期储蓄帐户性质
072000   05 C-SA-DEPOSIT-ACCT-CHAR    PIC X(4) VALUE '0000'.
072100
072200*其他子系统使用的帐户性质(对私储蓄-调用KSAACN1时赋空)
072300   05 C-NON-SA-ACCT-CHAR.
072400*对公信用卡
072500       10 C-SA-COM-CREDIT-CARD   PIC X(4) VALUE '0000'.
072600*对私信用卡
072700       10 C-SA-PRI-CREDIT-CARD   PIC X(4) VALUE '0000'.
072800*临时人民币存款户
072900       10 C-SA-TEMP-ACCT-RMB     PIC X(4) VALUE '1400'.
073000*临时外币币存款户
073100       10 C-SA-TEMP-ACCT-FCURR   PIC X(4) VALUE '2400'.
      *个人结算帐户
             10 C-SA-STL-ACCT          PIC X(4) VALUE '4100'.
      *个人储蓄帐户
             10 C-SA-SAV-ACCT          PIC X(4) VALUE '4200'.
073000*支票通账户
073100       10 C-SA-CHK-ACCT          PIC X(4) VALUE '4300'.
073200*事故处理的功能号
073300   05 C-SA-EVT-FUNC.
073400*新增
073500       10 C-SA-ADD               PIC X(1) VALUE '1'.
073600*查询
073700       10 C-SA-QUERY             PIC X(1) VALUE '2'.
073800*设置已处理
073900       10 C-SA-SET-PROCESSED     PIC X(1) VALUE '3'.
074000*设置未处理
074100       10 C-SA-SET-NOT-PROCESSED PIC X(1) VALUE '4'.
074200*子交易序号
074300   05 C-SA-SUB-TX-COD.
074400*理财
074500       10 C-SA-FUN-PFIN          PIC X(2) VALUE '05'.
074600*协定存款设定
074700       10 C-SA-AGR-MARK          PIC X(2) VALUE '06'.
      *未申报帐户转申报帐户
             10 C-SA-RPT-ACCT          PIC X(2) VALUE '07'.
      *未申报帐户取消
             10 C-SA-CANCEL-RPT        PIC X(2) VALUE '08'.
      *外汇买卖属性维护
             10 C-SA-FRN-CURR          PIC X(2) VALUE '09'.
      *约定存款取消
             10 C-SA-CANCEL-PFIN       PIC X(2) VALUE '10'.
      * 修改签约标志
             10 C-SA-FUN-SIGN-FLG      PIC X(2) VALUE '11'.
      * 修改账户性质
             10 C-SA-FUN-1006          PIC X(2) VALUE '13'.
      * 修改小额标志
             10 C-SA-FUN-LESS-INTR     PIC X(2) VALUE '14'.
      * 支付密码维护申请
             10 C-SA-FUN-DRW-TYP       PIC X(2) VALUE '15'.
      * 支付密码撤销申请
             10 C-SA-CANCEL-DRW-TYP    PIC X(2) VALUE '16'.
      * 修改通兑标志
             10 C-SA-FUN-DPDW-FLG      PIC X(2) VALUE '17'.
      * 修改免收对公维护费标志
             10 C-SA-FUN-ENT-MAFE-FLG  PIC X(2) VALUE '18'.
CZG+  * 个人活期凭印支取方式维护
CZG+         10 C-SA-FUN-SL-DRW-TYP    PIC X(2) VALUE '19'.
074800
074900*进帐单转帐标志,用于存入进帐单转帐记会计分录
075000*  05 C-SA-ACCT-ENT-LIST-TR-FLG.
075100*进帐单转帐
075200*      10 C-SA-ACCT-ENT-LIST-TR  PIC X(1)
075300*                                VALUE '1'.
075400*非进帐单转帐
075500*      10 C-SA-NON-ACCT-ENT-LIST-TR PIC X(1)
075600*                                VALUE '0'.
      *密码维护功能号 OF 1005
065700   05 C-SA-OF-1005.
      *查询密码
             10 C-SA-INQ-PSWD          PIC X(1) VALUE '0'.
065800*修改密码
065900       10 C-SA-UPD-PSWD          PIC X(1) VALUE '1'.
066000*密码挂失
066100       10 C-SA-PSWD-DELE         PIC X(1) VALUE '2'.
066200*新增密码
066300       10 C-SA-ADD-NEW-PSWD      PIC X(1) VALUE '3'.
066400*取消密码
066500       10 C-SA-CANCEL-PSWD       PIC X(1) VALUE '4'.
140109*密码重置
140109       10 C-SA-RESET-PSWD        PIC X(1) VALUE '5'.
      *密码解挂
             10 C-SA-RDL-PSWD          PIC X(1) VALUE '6'.
      *密码补设生效
             10 C-SA-APPEND-ENABLE-PSWD PIC X(1) VALUE '7'.
      *增加指纹
             10 C-SA-ADD-FINGER        PIC X(1) VALUE '8'.
      *取消指纹
             10 C-SA-CANCEL-FINGER     PIC X(1) VALUE '9'.
      *指纹+密码转指纹或密码
             10 C-SA-AND-TO-OR         PIC X(1) VALUE 'A'.
      *指纹或密码转指纹+密码
             10 C-SA-OR-TO-AND         PIC X(1) VALUE 'B'.
      *指纹作废
             10 C-SA-DISAB-FINGER      PIC X(1) VALUE 'C'.

      *没收/上缴功能
         05 C-SA-CONFISCATE-HANDIN-FUNC.
      * 全部没收
             10 C-SA-CONFISCATE        PIC X(1) VALUE '1'.
      * 部分没收
             10 C-SA-CONFISCATE-PART   PIC X(1) VALUE '2'.
      * 全部上缴
             10 C-SA-HANDIN            PIC X(1) VALUE '3'.
      * 部分上缴
             10 C-SA-HANDIN-PART       PIC X(1) VALUE '4'.
      *专用业务手续费费率
         05 C-SA-PROF-FRT-COD          PIC X(1) VALUE '8'.
      * FUNC OF CSACID0
         05 C-SA-FUNC-OF-CSACID0.
      * 身份证核实
             10 C-SA-CHECK-ID          PIC X(1) VALUE '1'.
      * 核实客户编号是否机器自动产生
             10 C-SA-AUTO-GEN          PIC X(1) VALUE '2'.
     *对公帐户是否申报标志
         05 C-SA-RPT-ACCT-FLG.
      *  已申报
             10 C-SA-RPT-ACCT-YES      PIC X(1) VALUE '1'.
      *  未申报
             10 C-SA-RPT-ACCT-NO       PIC X(1) VALUE '0'.
      *是否允许外汇买卖标志
         05 C-SA-FRN-CURR-BUSN-FLG.
      *  允许
             10 C-SA-FRN-BUSN-YES      PIC X(1) VALUE '1'.
      *  不允许
             10 C-SA-FRN-BUSN-NO       PIC X(1) VALUE '0'.
      *交易地点类型GSA01069
         05 C-SA-ADDR-TX-TYP.
      * 0=柜台交易, 1=电话交易, 2=代客套汇
             10 C-SA-MANUAL-TYP        PIC X(1) VALUE '0'.
             10 C-SA-PHONE-TYP         PIC X(1) VALUE '1'.
             10 C-SA-OTHER-TYP         PIC X(1) VALUE '2'.
      *借用该栏位
      * 4= 冲正还透支
             10 C-SA-RETURN-TYP        PIC X(1) VALUE '4'.
      * 隔日冲正 冲正类型 GSA01075
         05 C-EC-TYP.
ZLHSD-** 活期转活期
ZLHSD-*       10 C-SA-SATOSA           PIC X(1) VALUE '0'.
ZLHSD-** 活期转卡
ZLHSD-*       10 C-SA-SATOCRD          PIC X(1) VALUE '1'.
ZLHSD-** 卡转卡
ZLHSD-*       10 C-SA-CRDTOCRD         PIC X(1) VALUE '2'.
ZLHSD-** 卡转活期
ZLHSD-*       10 C-SA-CRDTOSA          PIC X(1) VALUE '3'.

ZLHSD+* 活期转活期
ZLHSD+       10 C-SA-SA2SA             PIC X(1) VALUE '0'.
ZLHSD+* 活期转卡
ZLHSD+       10 C-SA-SA2CRD            PIC X(1) VALUE '1'.
ZLHSD+* 卡转卡
ZLHSD+       10 C-SA-CRD2CRD           PIC X(1) VALUE '2'.
ZLHSD+* 卡转活期
ZLHSD+       10 C-SA-CRD2SA            PIC X(1) VALUE '3'.
ZLHSD+* 活期转标准户
ZLHSD+       10 C-SA-SA2INT            PIC X(1) VALUE '4'.
ZLHSD+* 标准户转活期
ZLHSD+       10 C-SA-INT2SA            PIC X(1) VALUE '5'.
ZLHSD+* 卡转标准户
ZLHSD+       10 C-SA-CRD2INT           PIC X(1) VALUE '6'.
ZLHSD+* 标准户转卡
ZLHSD+       10 C-SA-INT2CRD           PIC X(1) VALUE '7'.

      ********** 计息类别
           05  C-SA-INTC-TYPE.
      *365/365= 积数计算天数/年利率所除的天数
             10 C-SA-365365            PIC X(1) VALUE '1'.
      *360/360
             10 C-SA-360360            PIC X(1) VALUE '2'.
      *365/360
             10 C-SA-365360           PIC X(1) VALUE '3'.
      *360/365
             10 C-SA-360365           PIC X(1) VALUE '4'.
           05  C-SA-OVDLN-LMT-DAY     PIC 9(3) VALUE 90.
      *FUNC OF CSACTL0
           05 C-SA-FUNC-OF-CSACTL0.
      *查询
             10 C-SA-INQUIRE           PIC X(1) VALUE '0'.
      *设置
             10 C-SA-SET               PIC X(1) VALUE '1'.
      *解除
             10 C-SA-FREE              PIC X(1) VALUE '2'.
      *继续
             10 C-SA-CONTINUE          PIC X(1) VALUE '3'.
      *帐户控制状态
           05 C-SA-CTL-STS.
      *正常
             10 C-SA-CTL-NORMAL        PIC X(1) VALUE '0'.
      *只收不付
             10 C-SA-CTL-RCV-NO-PAY    PIC X(1) VALUE '1'.
      *只付不收
             10 C-SA-CTL-PAY-NO-RCV    PIC X(1) VALUE '2'.
      *封存(不付不收)
             10 C-SA-CTL-LOCK          PIC X(1) VALUE '3'.

      *FUNC OF CSAAFR0
           05 C-SA-FUNC-OF-CSAAFR0.
      *查询
             10 C-SA-QUERY-AFR         PIC X(1) VALUE '1'.
      *冻结
             10 C-SA-FRZ               PIC X(1) VALUE '2'.
      *续冻
             10 C-SA-REFRZ             PIC X(1) VALUE '3'.
      *解冻
             10 C-SA-UNFRZ             PIC X(1) VALUE '4'.
      *资金控制状态
           05 C-SA-AMT-STS.
      *全部
             10 C-SA-ALL               PIC X(1) VALUE '2'.
      *部分
             10 C-SA-PART              PIC X(1) VALUE '1'.
      *单向冻结
             10 C-SA-UNILATERAL        PIC X(1) VALUE '3'.
      *扣押
             10 C-SA-DTN               PIC X(1) VALUE '4'.
      *扣押解除
             10 C-SA-UNDTN             PIC X(1) VALUE '5'.
      *圈存
             10 C-SA-CIRDEP            PIC X(1) VALUE '6'.
140714*可占用圈存
140714       10 C-SA-LOWPT             PIC X(1) VALUE '7'.

      *贷方冻结
             10 C-SA-CEDT              PIC X(1) VALUE '8'.
      * 汇兑圈存 EXCHANGE CIRCLE FOR LOAD
             10 C-SA-ECL-LOWPT         PIC X(1) VALUE '9'.    

           05 C-SA-FUNC-OF-GSA01087.
      *退税
             10 C-SA-RTRN-TAX          PIC X(1) VALUE '1'.
      *补税
             10 C-SA-SUPLMNT-TAX       PIC X(1) VALUE '2'.

      *人民币帐户性质
           05 C-SA-SAL.
      *人民币基本存款帐户
             10 C-SA-BSC-ACCT          PIC X(3) VALUE '100'.
      *人民币一般存款帐户
             10 C-SA-NOR-ACCT          PIC X(3) VALUE '200'.
      *人民币专用存款帐户
             10 C-SA-SPC-ACCT          PIC X(3) VALUE '300'.
      *人民币临时存款帐户
             10 C-SA-TMP-ACCT          PIC X(3) VALUE '400'.
      *应解汇款及临时存款
             10 C-SA-RMT-ACCT          PIC X(3) VALUE '500'.
      *人民币保证金
             10 C-SA-MGN-ACCT          PIC X(3) VALUE '600'.
      *同业存款
             10 C-SA-SBK-ACCT          PIC X(3) VALUE '700'.
      *个人支票存款
             10 C-SA-IDC-ACCT          PIC X(3) VALUE '800'.
      *委贷基金
             10 C-SA-CSN-ACCT          PIC X(3) VALUE '900'.

      *透支科目标志
           05 C-SA-OD-LG-FLG.
      *透支
             10 C-SA-CR-OD-LG          PIC X(1) VALUE '1'.
      *逾期
             10 C-SA-DLAY-OD-LG        PIC X(1) VALUE '2'.
      *非应计
             10 C-SA-BDDB-OD-LG        PIC X(1) VALUE '3'.
      *呆帐贷款
             10 C-SA-MISC-OD-LG        PIC X(1) VALUE '4'.
      *核销
             10 C-SA-CAVC-OD-LG        PIC X(1) VALUE '5'.

      *信用卡透支转逾期贷款天数
           05 C-SA-DLAY-DAY            PIC 9(4) VALUE 60.
      *呆滞贷款天数
           05 C-SA-BDDB-DAY            PIC 9(4) VALUE 90.
      *呆帐贷款天数
           05 C-SA-MISC-DAY            PIC 9(4) VALUE 360.

           05 C-SA-FUNC-OF-GSA01017.
      *增加凭证件支取
             10 C-SA-ADD-DRW-BY-ID     PIC X(1) VALUE '1'.
      *取消凭证件支取
             10 C-SA-CAN-DRW-BY-ID     PIC X(1) VALUE '2'.

           05 C-SA-FUNC-OF-GSA01018.
      *查询透支科目　　　　
             10 C-SA-QRY-ODLG-FLG      PIC X(1) VALUE '1'.
      *修改透支科目　
             10 C-SA-UPD-ODLG-FLG      PIC X(1) VALUE '2'.

      *交易途径GSA01132 && GSA01123
         05 C-SA-TX-PLACE.
      * 1=B2B交易提出2=异地付款3=重要客户系统提出
             10 C-SA-B2B-PLACE         PIC X(1) VALUE '1'.
             10 C-SA-IMPT-PLACE        PIC X(1) VALUE '2'.
             10 C-SA-IMPT-CLRIN        PIC X(1) VALUE '3'.

      * 活期帐户挂入/挂出
         05 C-SA-FUNC-OF-CSAAIO1.
      * 挂入
             10 C-SA-IN-FS-ACCT        PIC X(1) VALUE '1'.
             10 C-SA-OUT-FS-ACCT       PIC X(1) VALUE '2'.
             10 C-SA-IN-DCARD-FS-ACCT  PIC X(1) VALUE '3'.
             10 C-SA-OUT-DCARD-FS-ACCT PIC X(1) VALUE '4'.
             10 C-SA-IN-NPSBK-FS-ACCT  PIC X(1) VALUE '5'.
             10 C-SA-OUT-NPSBK-FS-ACCT PIC X(1) VALUE '6'.

      * 大额签约标志
         05 C-SA-SIGN-FLG.
             10 C-SA-SIGN-FLG-YES      PIC X(1) VALUE '1'.
             10 C-SA-SIGN-FLG-NO       PIC X(1) VALUE '0'.

         05 C-SA-FUNC-OF-GSA01141.
      *查询大额签约状态
             10 C-SA-SIGN-FLG-QUERY    PIC X(1) VALUE '1'.
      *大额签约　　　　　
             10 C-SA-SIGN-FLG-NEW      PIC X(1) VALUE '2'.
      *大额签约取消　　　
             10 C-SA-SIGN-FLG-CAN      PIC X(1) VALUE '3'.

      * 信用卡核销呆帐后续处理
         05 C-SA-FUNC-OF-KSACAV1.
             10 C-SA-QUERY-CAV1        PIC X(1) VALUE '1'.
             10 C-SA-TAKEBACK          PIC X(1) VALUE '2'.
             10 C-SA-GIVEUP            PIC X(1) VALUE '3'.

      * 计透支息类别
         05  C-SA-OD-INTC-TYPE.
      * 365/360= 积数计算天数/年利率所除的天数
             10 C-SA-OD-PDT-DAYS       PIC 9(3) VALUE 365.
             10 C-SA-OD-INTR-DAYS      PIC 9(3) VALUE 360.

      * 法人帐户透支标志
         05  C-SA-COM-OD-FLG.
             10 C-SA-COM-OD-NO         PIC X(1) VALUE '0'.
             10 C-SA-COM-OD-YES        PIC X(1) VALUE '1'.
             10 C-SA-COM-OD-BOTH       PIC X(1) VALUE '2'.

         05  C-SA-FUNC-OF-1152.
             10 C-SA-1152-QUERY        PIC X(1) VALUE '0'.
             10 C-SA-1152-SET          PIC X(1) VALUE '1'.
             10 C-SA-1152-CANCEL       PIC X(1) VALUE '2'.
             10 C-SA-1152-PAUSE        PIC X(1) VALUE '3'.
             10 C-SA-1152-RECOVER      PIC X(1) VALUE '4'.
             10 C-SA-1152-UPDATE       PIC X(1) VALUE '5'.

      *1084 是否结息 FUNC
         05  C-SA-FUNC-OF-1084.
             10 C-SA-1084-INT          PIC X(1) VALUE '0'.
             10 C-SA-1084-OD-INT       PIC X(1) VALUE '1'.
             10 C-SA-1084-INT-ALL      PIC X(1) VALUE '2'.

      * 单位透支帐户结计透支息日期
         05  C-SA-COM-OD-INT-CLS-DT    PIC X(2) VALUE '20'.

      * 单位透支帐户逾期转呆滞天数
         05  C-SA-COM-BDDB-DYAS        PIC 9(2) VALUE 90.

      * 单位透支帐户应收转催收天数
         05  C-SA-COM-OVDLN-DYAS       PIC 9(2) VALUE 90.

      * 通兑范围
         05  C-SA-DPDW-RANG.
      *对私取值
      *　全国通存通兑
             10 C-SA-DPDW-COUNTRY      PIC X(1) VALUE '1'.
      *　全省通存通兑
             10 C-SA-DPDW-PROVINCE     PIC X(1) VALUE '2'.
      *　全市通存通兑
             10 C-SA-DPDW-CITY         PIC X(1) VALUE '3'.
      *对公取值
      *   全国通存
              10 C-SA-DP-COUNTRY       PIC X(1) VALUE '4' .
      *   全省通存
              10 C-SA-DP-PROVINCE      PIC X(1) VALUE '5' .
      *   全市通存
              10 C-SA-DP-CITY          PIC X(1) VALUE '6' .
      *   不通存（定点存）
              10 C-SA-SPECIAL-DP       PIC X(1) VALUE '7' .
      *   县（支行）内通兑
               10 C-SA-DP-SUBBRH       PIC X(1)
                                       VALUE '8' .

         05 C-SA-FUNC-OF-CSAACN4.
      *   计息转为不计息
              10 C-SA-NO-CAL-INT-FUNC  PIC X(1) VALUE '1'.
      *   不计息转为计息
              10 C-SA-CAL-INT-FUNC     PIC X(1) VALUE '2'.
      *   设为总公司
              10 C-SA-SET-HEAD-COP     PIC X(1) VALUE '3'.
      *   设为分公司
              10 C-SA-SET-BRH-COP      PIC X(1) VALUE '4'.
      *   取消总分公司
              10 C-SA-UNSET-COP        PIC X(1) VALUE '5'.
      *   暂停分公司签约
              10 C-SA-STOP-COP         PIC X(1) VALUE '6'.
      *   总公司标志
              10 C-SA-HEAD-COP         PIC X(1) VALUE '1'.
      *   分公司标志
              10 C-SA-BRH-COP          PIC X(1) VALUE '2'.
      *   子公司暂停签约
              10 C-SA-STP-BRH-COP      PIC X(1) VALUE '3'.

      * 睡眠状态
         05  C-SA-SLEEP-STS.
             10 C-SA-SLEEP-NORMAL      PIC X(1) VALUE '0'.
             10 C-SA-PRE-SLEEP         PIC X(1) VALUE '1'.
             10 C-SA-SLEEP             PIC X(1) VALUE '2'.
             10 C-SA-PRE-APPROVE       PIC X(1) VALUE '3'.
             10 C-SA-PASS-APPROVE      PIC X(1) VALUE '4'.
             10 C-SA-OUT-BUSN          PIC X(1) VALUE '5'.
             10 C-SA-OUT-PRE-APPROVE   PIC X(1) VALUE '6'.
             10 C-SA-OUT-PASS-APPROVE  PIC X(1) VALUE '7'.
             10 C-SA-PRE-PRE-APPROVE   PIC X(1) VALUE '8'.
             10 C-SA-PRE-PASS-APPROVE  PIC X(1) VALUE '9'.
      * 利率依据
         05  C-SA-INTR-COD.
             10 C-SA-INTR-VALUE        PIC X(2) VALUE '00'.
             10 C-SA-INTR-SAP          PIC X(2) VALUE '01'.
             10 C-SA-INTR-FLOAT        PIC X(2) VALUE '02'.

      * 浮动利率加减码符号位
         05 C-SA-FLTR-FVR-SIGN.
             10 C-SA-FLTR-FVR-ADD      PIC X(1) VALUE '1'.
             10 C-SA-FLTR-FVR-SUB      PIC X(1) VALUE '2'.
             10 C-SA-FLTR-FVR-MUL      PIC X(1) VALUE '3'.

      * 收费方式  FOR KSAFEEC
         05 C-SA-FEE-TYPE.
             10 C-SA-FEE-INPUT         PIC X(1) VALUE '1'.
             10 C-SA-FEE-PARM          PIC X(1) VALUE '2'.
             10 C-SA-FEE-REFORCE       PIC X(1) VALUE '3'.
             10 C-SA-FEE-CC            PIC X(1) VALUE '4'.
             10 C-SA-FEE-INQUIRE       PIC X(1) VALUE '5'.

      * 收费项目
         05 C-SA-FEE-ITEM.
             10 C-SA-ITEM-BIG-CASH     PIC X(8) VALUE '10129000'.
             10 C-SA-ITEM-COP-MTN      PIC X(8) VALUE '10131000'.
             10 C-SA-ITEM-SLP-MTN      PIC X(8) VALUE '10132000'.
             10 C-SA-ITEM-SLD-LOS      PIC X(8) VALUE '10136000'.
             10 C-SA-ITEM-SLD-CHG      PIC X(8) VALUE '10137000'.
             10 C-SA-ITEM-COP-OD-MTN   PIC X(8) VALUE '50203000'.

      * 小额标志
         05 C-SA-LESS-INTR-FLG.
             10 C-SA-COMM-INTR         PIC X(1) VALUE '0'.
             10 C-SA-LESS-INTR         PIC X(1) VALUE '1'.
         05 C-SA-MAFE-FLG.
             10 C-SA-NON-MAFE          PIC X(1) VALUE '0'.
             10 C-SA-MAFE              PIC X(1) VALUE '1'.
         05 C-SA-MAFE-CARD-FLG.
             10 C-SA-MAFE-NON-CARD     PIC X(1) VALUE '0'.
             10 C-SA-MAFE-INCD-CARD    PIC X(1) VALUE '1'.

      * 汇总明细标志
         05 C-SA-COLLECT-TXN-FLG.
             10 C-SA-NON-COLLECT       PIC X(1) VALUE '0'.
             10 C-SA-COLLECT           PIC X(1) VALUE '1'.

      * 个人不动户
         05 C-SA-PRI-1167-FLG.
             10 C-SA-SLEEP-NOR-FLG     PIC X(1) VALUE '1'.
             10 C-SA-NOR-SLEEP-FLG     PIC X(1) VALUE '2'.
             10 C-SA-SLEEP-OUT-FLG     PIC X(1) VALUE '3'.

      * 大额存款灵活计息标志
      *  05 C-SA-COM-FLG.
      *      10 C-SA-LARGE-DEP-ACN     PIC X(1) VALUE '0'.
      *      10 C-SA-NON-LARGE-ACN     PIC X(1) VALUE '1'.
      * 对公帐户欠费免除标志
         05 C-SA-COM-FLG.
             10 C-SA-OWE-NORMAL        PIC X(1) VALUE '0'.
      *     欠费不免除
             10 C-SA-OWE-PRE-APPROVE   PIC X(1) VALUE '1'.
      *     欠费免除待审批
             10 C-SA-OWE-PASS-APPROVE  PIC X(1) VALUE '2'.
      *     欠费免除已审批
      * 冻结类型标志
         05 C-SA-FRZ-TYPE-FLG.
      * 0:其它冻结
             10 C-SA-FRZ-OTHERS        PIC X(1) VALUE '0'.
      * 1:质押炒汇冻结
             10 C-SA-FRZ-HYPO          PIC X(1) VALUE '1'.
      * A:银行承兑汇票的保证金冻结
             10 C-SA-FRZ-RE            PIC X(1) VALUE 'A'.
150910* B 信用证的保证金冻结
150910       10 C-SA-FRZ-CREDIT        PIC X(1) VALUE 'B'.
140714* L:可占用圈存
  |          10 C-SA-FRZ-LOWPRT        PIC X(1) VALUE 'L'.
      * E：汇兑圈存
             10 C-SA-FRZ-ECLOWPT       PIC X(1)  VALUE 'E'.
  |   * 轮候标志组
  |      05 C-SA-WAIT-GRP.
  |   * 1:已冻结
  |          10 C-SA-EFFECTIVE         PIC X(1) VALUE '1'.
  |   * 2:等待冻结
  |          10 C-SA-WAIT              PIC X(1) VALUE '2'.
  |   * 3:解除冻结
140714       10 C-SA-WAIT-UNFRZ        PIC X(1) VALUE '3'.

      *  对公通兑加盟店标志CMMSCSAJ
         05 C-SA-JOIN-TYPE-FLG.
      *   不通兑
             10 C-SA-NO-JOIN           PIC X(1) VALUE '0'.
      *   同城通兑
             10 C-SA-INCITY-JOIN       PIC X(1) VALUE '1'.
      *   省内城市间通兑
             10 C-SA-INPROVINCE-JOIN   PIC X(1) VALUE '2'.

      * 1002功能说明
         05 C-SA-1002-FUNC.
      *   查询
             10 C-SA-1002-QUERY        PIC X(1) VALUE '1'.
      *   新增
             10 C-SA-1002-INSERT       PIC X(1) VALUE '2'.
      *   修改
             10 C-SA-1002-EDIT         PIC X(1) VALUE '3'.
      *   删除
             10 C-SA-1002-DELETE       PIC X(1) VALUE '4'.

         05  C-SA-FESP-CODE.
      * 外汇结构性存款新增    20060323
             10 C-SA-FESP-DEP-TYP      PIC X(2) VALUE '04'.
      *        结构性存款存款种类（改成０４）
             10 C-SA-FESP-FRZ          PIC X(4) VALUE '2140' .
      *        结构性存款冻结
             10 C-SA-FESP-UNFRZ        PIC X(4) VALUE '2240' .
      *        结构性存款解冻
             10 C-SA-FESP-HYP-FRZ      PIC X(4) VALUE '2150' .
      *        结构性存款存款证明冻结
             10 C-SA-FESP-HYP-UNFRZ    PIC X(4) VALUE '2250' .
      *        结构性存款存款证明解冻
             10 C-SA-FESP-DTN          PIC X(4) VALUE '2160' .
      *        结构性存款质押设定
             10 C-SA-FESP-UNDTN        PIC X(4) VALUE '2260' .
      *        结构性存款质押解除
             10 C-SA-FESP-EDIT-NGO-NO  PIC X(4) VALUE '9052' .
      *        结构性存款修改协议编号
      * CSAGUA0功能号
          05 C-SA-FUNC-CODE-OF-CSAGUA0.
      *保付
             10 C-SA-FUNC-GUAR         PIC X(1) VALUE '0'.
      *解除保付
             10 C-SA-FUNC-GUAR-FREE    PIC X(1) VALUE '1'.
      *查询保付汇总金额
             10 C-SA-FUNC-GUAR-QUERY   PIC X(1) VALUE '2'.
      * CSAACN9功能号
          05 C-SA-FUNC-CSAACN9.
             10 C-SA-FUNC-SET-ACCT-CHAR PIC X(1) VALUE '1'.
             10 C-SA-FUNC-BAK-ACCT-CHAR PIC X(1) VALUE '2'.
      * CSASLC0功能号
          05 C-SA-FUNC-CSASLC0.
             10 C-SA-FUNC-ADD-SL        PIC X(1) VALUE '1'.
             10 C-SA-FUNC-CAN-SL        PIC X(1) VALUE '2'.
      * TFT-PAY-COD支付依据
          05 C-SA-PAY-COD.
             10 C-SA-BY-SEAL            PIC X(1) VALUE '1'.
             10 C-SA-BY-CERT            PIC X(1) VALUE '2'.
             10 C-SA-BY-PSBK            PIC X(1) VALUE '3'.
             10 C-SA-BY-CRD             PIC X(1) VALUE '4'.
             10 C-SA-BY-OTHER           PIC X(1) VALUE '5'.
      * CSAACS1集团客户签约
          05 C-SA-FUNC-CSAACS1.
             10 C-SA-CSAACS1-INQUIRE    PIC X(1) VALUE '1'.
      *      查询
             10 C-SA-CSAACS1-ADD        PIC X(1) VALUE '2'.
      *      签约
             10 C-SA-CSAACS1-DELETE     PIC X(1) VALUE '3'.
      *      解约
          05 C-SA-OPAC-TYP-CSAACS1.
             10 C-OPAC-TYP-ACCT         PIC X(1) VALUE '1'.
      *      帐户层
             10 C-OPAC-TYP-TYP          PIC X(1) VALUE '2'.
      *      业务编号层
          05 C-SA-ACLG.
      *     集团客户银保签约标志
             10 C-SA-NO-SIGN            PIC X(1) VALUE '0'.
      *      未签约
             10 C-SA-BI-SIGN            PIC X(1) VALUE '1'.
      *      银保签约
             10 C-SA-COA-SIGN           PIC X(1) VALUE '2'.
      *      集团客户签约
             10 C-SA-BOTH-SIGN          PIC X(1) VALUE '3'.
      *      同时签约
          05 C-SA-TX-TYP-COD.
      *     业务类别代码
             10 C-SA-COA-COD            PIC X(3) VALUE 'Z01'.
      ** 1181 功能说明
      *  归还透支
           05  C-SA-FUNC-1181-POD     PIC X(01) VALUE '1'.
      *  资金归集
           05  C-SA-FUNC-1181-COL     PIC X(01) VALUE '2'.

      *  周期支付限额控制
           05  C-SA-LMT-CTL-FLG.
             10 C-SA-LMT-CTL-NO         PIC X(1) VALUE '0'.
      *      未签约
             10 C-SA-LMT-CTL-YES        PIC X(1) VALUE '1'.
      *      签约

      *  集团虚账户标志
         05  C-SA-VIR-ACCT-YES         PIC X(1) VALUE '1'.

      *  集团虚账户存款
         05  C-SA-VIR-DEP-TYP          PIC X(2) VALUE 'ZZ'.

      *  集团实虚模式账户标志
         05  C-SA-GRP-SIGN-FLG.
             10 C-SA-HEAD-ACCT         PIC X(1) VALUE 'H'.
      *       总账户
             10 C-SA-MIDDLE-ACCT       PIC X(1) VALUE 'M'.
      *       中间分账户
             10 C-SA-TAIL-END-ACCT     PIC X(1) VALUE 'T'.
      *       端末子账户

      *   外汇保证金帐户标志
         05  C-SA-XT-ACCT-FLG.
             10 C-SA-XT-HEAD-ACCT      PIC X(1) VALUE '1'.
      *       外汇保证金主账户
             10 C-SA-XT-BRA-ACCT       PIC X(1) VALUE '2'.
      *       外汇保证金子账户
             10 C-SA-XT-HEAD-NOSIGN    PIC X(1) VALUE '0'.
      *       外汇保证金主账户解签
             10 C-SA-XT-BRA-NOSIGN     PIC X(1) VALUE '3'.
      *       外汇保证金子账户解约

         05 C-SA-INT-MODE.
             10 C-SA-INT-MODE-1        PIC X(1) VALUE '1'.
      *   对协定存款统一计利率
             10 C-SA-INT-MODE-2        PIC X(1) VALUE '2'.
      *   对协定存款分段计利率
         05 C-SA-CANCEL-MODE.
             10 C-SA-CANCEL-MODE-0     PIC X(1) VALUE '0'.
      *    0－销户不收费
             10 C-SA-CANCEL-MODE-1     PIC X(1) VALUE '1'.
      *    1－销户收费
             10 C-SA-CANCEL-MODE-2     PIC X(1) VALUE '2'.
      *    2－开户已满XX月不收费
130816***  利率市场化项目,增加协议存款账户利率变动事故
         05 C-SA-ACCD-CONTR-CHG-CODE   PIC X(4) VALUE '9029'.
      *    手输利率或浮动利率，利率值变动事故代码

150510***  在单户议价产品权限维护时，协议存款单独维护,不受限于产品
150510   05 C-SA-NGO-PDP-CODE          PIC X(11) VALUE '999XNXDCK01'.
150510*    虚拟的产品代码--协定存款
150916*    账户质权状态
150916   05 C-SA-ACC-LHYPO-FLAG.
150916       10 C-SA-MANUAL-SET-FLAG   PIC X(1) VALUE '1'.
150916*    手动质权
150916       10 C-SA-AUTO-SET-FLAG     PIC X(1) VALUE '2'.
150916*    自动质权
150916       10 C-SA-MANUAL-REMOVE-FLAG
150916                                 PIC X(1) VALUE '3'.
150916*    手动解除质权
150916       10 C-SA-AUTO-REMOVE-FLAG  PIC X(1) VALUE '4'.
150916*    自动解除质权
150917*    质借标志
150917   05  C-SA-LHYPO-FLG.
150917*      正常
150917       10  C-SA-LHYPO-FLG-N      PIC X(1)
150917                                 VALUE '0'.
150917*      设定
150917       10  C-SA-LHYPO-FLG-Y      PIC X(1)
150917                                 VALUE '1'.
150917*    解冻标志
150917   05  C-SA-UNFRZ-FLAG.
150917*      付款解冻
150917       10  C-SA-UNFRZ-A          PIC X(1)
150917                                 VALUE '1'.
150917*    保函标志
150917   05  C-SA-GUALETTER-FLAG.
150917*      付款解冻
150917       10  C-SA-GUALETTER        PIC X(1)
150917                                 VALUE '1'.

150907*    质借交易票号维护功能号
150907  05 C-SA-HYP-REACC              PIC X(2) VALUE '06'.
150907*    质借交易银承质押解除功能号
150907  05 C-SA-HYP-DELETE             PIC X(2) VALUE '07'.
150907*    质借交易保函质押解除功能号
150907  05 C-SA-BH-DELETE              PIC X(2) VALUE '08'.
150907*    质借交易删除预查询功能号
150907  05 C-SA-HYP-D-INQUIRE          PIC X(2) VALUE '14'.
150907*    质借交易保函预查询功能号
150907  05 C-SA-BH-D-INQUIRE           PIC X(2) VALUE '18'.
      *     多级账簿账簿编码方式
WW1116   05 C-SA-COD-TYP.
WW1116*          0-系统生成
WW1116        10 C-SA-COD-TYP-0        PIC X(1) VALUE '0'.
WW1116*          1-自定义
WW1116        10 C-SA-COD-TYP-1        PIC X(1) VALUE '1'.
WW1118*   多级账簿计息方式
WW1118   05 C-SA-BKH-INTC-TYP.
WW1118*       0-按账户计息
WW1118        10 C-SA-BKH-INTC-BY-ACCT       PIC X(1) VALUE '0'.
WW1118*       1-按同一利率账簿计息
WW1118        10 C-SA-BKH-INTC-BY-COMMON     PIC X(1) VALUE '1'.
WW1118*       2-按自定义利率账簿计息
WW1118        10 C-SA-BKH-INTC-BY-DETAIL     PIC X(1) VALUE '2'.
WW1118*
151215***  理财系统新增功能号
         05 C-SA-LCXT-FUN1             PIC X(1) VALUE '1'.
      *    1-解冻
         05 C-SA-LCXT-FUN2             PIC X(1) VALUE '2'.
      *    2-解冻并扣款
         05 C-SA-LCXT-FUN3             PIC X(1) VALUE '3'.
      *    3-存款
         05 C-SA-LCXT-FUN4             PIC X(1) VALUE '4'.
      *    4-存款并冻结

         05 C-SA-LCXT-FUN5             PIC X(1) VALUE '5'.
      *    存款并司法冻结

      *    介质主档注销原因
         05 C-SA-CAL-REASON.
              10 C-SA-FLG1             PIC X(1) VALUE '1'.
      *       损坏注销
              10 C-SA-FLG2             PIC X(1) VALUE '2'.
      *       挂失注销
              10 C-SA-FLG3             PIC X(1) VALUE '3'.
      *       销户注销
              10 C-SA-FLG4             PIC X(1) VALUE '4'.
      *       更换介质注销

      *    协定存款合同生效标志
         05 C-SA-AGX-VAL.
              10 C-SA-VAL-Y            PIC X(1) VALUE '0'.
      *          0-合同生效
              10 C-SA-VAL-N            PIC X(1) VALUE '1'.
      *          1-合同未生效
              10 C-SA-VAL-U            PIC X(1) VALUE '2'.
      *          2-合同已使用
      *    24小时标志
         05 C-SA-24H-MODE.
              10 C-SA-DAT-B            PIC X(1) VALUE '1'.
      *       日间
              10 C-SA-DAT-E            PIC X(2) VALUE '2'.
      *       日终
      *    特殊标志
         05 C-SA-SPEC-FLAG.
              10 C-SA-SPEC-FLAG-1      PIC X(1) VALUE '1'.
              10 C-SA-SPEC-FLAG-2      PIC X(1) VALUE '2'.
              10 C-SA-SPEC-FLAG-3      PIC X(1) VALUE '3'.
              10 C-SA-SPEC-FLAG-4      PIC X(1) VALUE '4'.
              10 C-SA-SPEC-FLAG-5      PIC X(1) VALUE '5'.
      *     协定存款合同设定子功能
         05 C-SA-NGO-FUNC.
              10 C-SA-NONGO-AGX        PIC X(2) VALUE '11'.
      *          无合约预设
              10 C-SA-NONGO-AGR        PIC X(2) VALUE '12'.
      *          无合约设定
              10 C-SA-NGO-NOEND-AGX    PIC X(2) VALUE '13'.
      *          有合约未终止的预设
              10 C-SA-NGO-END-AGX      PIC X(2) VALUE '14'.
      *          有合约已终止的预设
              10 C-SA-NGO-END-AGR      PIC X(2) VALUE '15'.
      *          有合约已终止的设定
      *    核身类型
         05 C-SA-ACCT-CHK.
              10 C-SA-ACCT-CHK-Y       PIC X(1) VALUE '1'.
      *          已当面核身
              10 C-SA-ACCT-CHK-N       PIC X(1) VALUE '2'.
      *          未当面核身
      * 同业账户用途
         05 C-SA-ACCT-USED.
      * 结算性
              10 C-SA-ACCT-PER         PIC X(2) VALUE '01'.
      * 投融资性
              10 C-SA-ACCT-FINAC       PIC X(2) VALUE '02'.
      * 特殊账户标识
         05 C-SA-SPC-ACCT-FLG.
      * 空
              10 C-SA-SPC-BLANK        PIC X(2) VALUE '00'.
      * 支付机构备付金账户(depository institution provisions account)
              10 C-SA-SPC-DIPA         PIC X(2) VALUE '01'.
      * 零余额账户(zero balance account)
              10 C-SA-SPC-ZBA          PIC X(2) VALUE '02'.
      * 自贸区账户(free trade account)
      *       10 C-SA-SPC-FTA          PIC X(2) VALUE '03'.
      * 托管账户(custodian account)
              10 C-SA-SPC-CA           PIC X(2) VALUE '03'.
      * 网络借贷资金存管专用账户(network CD funds account)
              10 C-SA-SPC-NFC          PIC X(2) VALUE '04'.
      * 监管账户(supervision account)
              10 C-SA-SPC-SVA          PIC X(2) VALUE '05'.
      * 止付标志
         05 C-PAY-FLG.
      *  不止付
              10 C-SA-PAY-NOR          PIC X(1) VALUE '0'.
      * 活期销户功能项
         05 C-SA-CAC-FUNC.
              10 C-SA-CAC-NORMAL       PIC X(1) VALUE '1'.
      * 正常销户
              10 C-SA-CAC-WRITTEN      PIC X(1) VALUE '2'.
      * 挂失销户

      *销户印鉴卡备注
          05 C-SA-CAC-RMRK.
              10 C-SA-SEL-CANCEL       PIC X(4) VALUE '作废'.

      *免执行小额利率标志
          05 C-SA-LESS-INTR-FLG.
              10 C-SA-LESS-INTR-FLG-Y  PIC X(1) VALUE 'Y'.
      *免除执行小额利率
              10 C-SA-LESS-INTR-FLG-N  PIC X(1) VALUE 'N'.
      *不免除执行小额利率

      *免收管理费标志
          05 C-SA-MAFE-FLG.
              10 C-SA-MAFE-FLG-Y       PIC X(1) VALUE 'Y'.
      *免收管理费
              10 C-SA-MAFE-FLG-N       PIC X(1) VALUE 'N'.
      *收取管理费
      * 多级账簿签约标志
          05  C-SA-BKH-FLG.
      * 0-开通多级账簿 1-未开通多级账簿
              10 C-SA-BKH-SIGN-YES     PIC X(1) VALUE '0'.

              10 C-SA-BKH-SIGN-NO      PIC X(1) VALUE '1'.
      * 多级账簿编号
          05  C-SA-BKH-NO.
      * 一级账簿
              10 C-SA-BKH-SEL          PIC X(5) VALUE '00000'.
      * 待清分账簿
              10 C-SA-BKH-WAT          PIC X(5) VALUE '99999'.
      * 司法冻结账簿
              10 C-SA-BKH-JDCFRZ       PIC X(5) VALUE '99998'.
      * 其他冻结账簿
              10 C-SA-BKH-OTFRZ        PIC X(5) VALUE '99997'.
      * 一户通签约类型
          05  C-SA-CAA-SIGN-TYP.
      * 单位一户通
              10 C-SA-CAA-SA-TS        PIC X(1) VALUE '1'.
      * 保证金一户通
              10 C-SA-CAA-GRT          PIC X(1) VALUE '2'.
      * 同业一户通
              10 C-SA-CAA-COR          PIC X(1) VALUE '3'.
      * 单位定期一户通
              10 C-SA-CAA-TD-TS        PIC X(1) VALUE '4'.
      * 多级账簿
              10 C-SA-CAA-BKH          PIC X(1) VALUE '5'.
      *交易方式
          05 C-SA-TX-MODE.
              10 C-SA-DEP-COD          PIC X(02) VALUE '01'.
      * 存折现金存入
              10 C-SA-TRNI-COD         PIC X(02) VALUE '08'.
      * 存折转账存入
      * 组别
          05 C-SA-BBN.
      *       活期
              10 C-SA-BBN-SA           PIC X(02) VALUE 'SA'.
      *       定期
              10 C-SA-BBN-TD           PIC X(02) VALUE 'TD'.
      * 节点
          05 C-SA-NODE.
      *       虚节点
              10 C-SA-NODE-FALSE       PIC X(01) VALUE '1'.
      *       实节点
              10 C-SA-NODE-TRUE        PIC X(01) VALUE '2'.
      * 一户通主账户序号
          05 C-SA-CAA-NO               PIC X(05) VALUE '00000'.
      * 一户通签约标志
          05 C-SA-SIGN.
      *       正常签约
              10 C-SA-SIGN-NOR         PIC X(01) VALUE '0'.
      *       开立
              10 C-SA-SIGN-YES         PIC X(01) VALUE '1'.
      *       失效
              10 C-SA-SIGN-NO          PIC X(01) VALUE '2'.
          05 C-CORP-DPDW-RANG.
      *       0-本法人
              10 C-CORP-RANG-LOC       PIC X(01) VALUE '0'.
      *       1-跨法人
              10 C-CORP-RANG-OP        PIC X(01) VALUE '1'.
          05 C-DIST-DPDW-RANG.
      *       全市
              10 C-DIST-RANG-CITY      PIC X(01) VALUE '3'.
      *       全省
              10 C-DIST-RANG-PROVINCE  PIC X(01) VALUE '2'.
      *       全国
              10 C-DIST-RANG-COUNTRY   PIC X(01) VALUE '1'.
      *    介质事故功能码
           05 C-SA-MEDM.
      *       事故查询
              10 C-SA-EVT-INQ          PIC X(01) VALUE '0'.
      *       密码更新
              10 C-SA-UP-PSWD          PIC X(01) VALUE '1'.
      *       介质口头挂失
              10 C-SA-DL-WORDY         PIC X(01) VALUE '2'.
      *       介质书面挂失
              10 C-SA-DL-WRITTEN       PIC X(01) VALUE '3'.
      *       解除挂失
              10 C-SA-UN-DL            PIC X(01) VALUE '4'.
      * 一户通开户
          05 C-SA-CAA-OPEN.
      *       主账号开户
              10 C-SA-CAA-MAIN-OPEN    PIC X(01) VALUE '1'.
      *       子账号开户
              10 C-SA-CAA-SUB-OPEN     PIC X(01) VALUE '2'.
      * 个人利息税申报功能
         05 C-SA-TAX-FUNC.
              10 C-SA-TAX-ADD          PIC X(1) VALUE '1'.
      * 个人利息税申报
              10 C-SA-TAX-DELE         PIC X(1) VALUE '2'.
      * 个人利息税解除申报
      * 账户编号，账户序号
          05 C-SA-ACCT-CODNO.
      *       账户编号
              10 C-SA-ACCT-COD         PIC X(04) VALUE '9000'.
      *       账户序号
              10 C-SA-ACCT-NO          PIC X(03) VALUE '001'.
      * 对公对私标志
          05 C-SA-P-U-FLG.
      *       对私标志
              10 C-SA-P-FLG            PIC X(01) VALUE 'P'.
      *       对公标志
              10 C-SA-U-FLG            PIC X(01) VALUE 'U'.
      * CSACAA1功能标志
          05 C-SA-DPDW-FUNC.
      *       存入交易
              10 C-SA-DP-FUNC          PIC X(01) VALUE '0'.
      *       支取交易
              10 C-SA-DW-FUNC          PIC X(01) VALUE '1'.
      * 限额类型
          05  SA-FC-LMT-TYPE.
      *    无限额
              10 SA-NONE-LMT-TYPE      PIC X(02) VALUE '11'.
      *    余额限额
              10 SA-VAL-LMT-TYPE       PIC X(02) VALUE '12'.
      *    贷方流入限额
              10 SA-CRE-LMT-TYPE       PIC X(02) VALUE '13'.
      * 一户通签约标志
          05 C-SA-ACCT-MANA-MODE.
      *       主账户汇总管理
              10 C-SA-TOTAL-MODE       PIC X(01) VALUE '1'.
      *       子账户独立管理
              10 C-SA-SIM-MODE         PIC X(01) VALUE '2'.
          05 C-SA-ACCT-SPACE           PIC X(02) VALUE '00'.
          05 C-SA-ACC-FLG.
      *    账户类别:I一类账户,II二类账户,III三类账户
              10 C-SA-ACC-I            PIC X(1) VALUE '1'.
      *          I类账户
              10 C-SA-ACC-II           PIC X(1) VALUE '2'.
      *          II类账户
              10 C-SA-ACC-III          PIC X(1) VALUE '3'.
      *          III类账户
      *    人民币账户性质
          05 C-SA-ACCT-CHAR.
      *人民币基本存款帐户
             10 C-SA-BSC-CHAR          PIC X(4) VALUE '1100'.
      *人民币一般存款帐户
             10 C-SA-NOR-CHAR          PIC X(4) VALUE '1200'.
      *人民币专用存款帐户
             10 C-SA-SPC-CHAR          PIC X(4) VALUE '1300'.
      * PCSAEVT0的指定冻结状态返回值
          05   C-FRZ-FLG.
           10 C-SA-FRZ-FLG-NO          PIC X(1) VALUE 'N'.
      *    没有冻结
           10 C-SA-FRZ-FLG-AMT         PIC X(1) VALUE '0'.
      *    有金额冻结
           10 C-SA-FRZ-FLG-ALL         PIC X(1) VALUE '2'.
      *    有双向冻结
           10 C-SA-FRZ-FLG-CEDT        PIC X(1) VALUE '5'.
      *    有贷方冻结
           10 C-SA-FRZ-FLG-DEBT        PIC X(1) VALUE '7'.
      *    有借方冻结
           10 C-SA-FRZ-FLG-GRAT        PIC X(1) VALUE 'A'.
      *    有保证金冻结
      *    授权撤销时重算金额检查标志
          05 C-SA-DYT-FLG.
      *不检查
             10 C-SA-DYT-FLG-N         PIC X(1) VALUE '0'.
      *检查
             10 C-SA-DYT-FLG-Y         PIC X(1) VALUE '1'.
      * 生效标志
          05 C-SA-EFFECTIVE-FLG.
      * 生效
             10 C-SA-EFFECTIVE-YES     PIC X(1) VALUE '0'.
      * 不生效
             10 C-SA-EFFECTIVE-NO      PIC X(1) VALUE '1'.
      *  已处理
             10 C-SA-EFFECTIVE-HAVE    PIC X(1) VALUE '2'.
      *    综合理财标志
          05 C-SA-FS-STS.
      *非理财卡
             10 C-SA-NFS-CARD          PIC X(1) VALUE '0'.
      *理财卡（可透支）
             10 C-SA-FS-CARD           PIC X(1) VALUE '1'.
      *普通卡(可透支)
             10 C-SA-COMMON-CARD       PIC X(1) VALUE '2'.
      *凸版卡(可透支)
             10 C-SA-CONVEX-CARD       PIC X(1) VALUE '3'.

      *  CSACIN1功能选项
          05 C-SA-FUN-CODE.
      *  功能1 修改客户编号
             10 C-SA-CUST-ID           PIC X(1) VALUE '1'.
      *  功能2 修改证件信息
             10 C-SA-CERT-INFO         PIC X(1) VALUE '2'.
      *  功能3 修改证件信息+客户编号
             10 C-SA-CUST-CERT         PIC X(1) VALUE '3'.
      * CSAAME0功能选项
          05 C-SA-FUNC.
             10 C-SA-GE-QRY            PIC X(1) VALUE '0'.
      * 功能0： 查询
             10 C-SA-GET-ADD           PIC X(1) VALUE '1'.
      * 功能1  :分期生效
             10 C-SA-GET-DEP           PIC X(1) VALUE '2'.
      * 功能2 ：存入/该分期之前的事故解冻、续冻
             10 C-SA-GET-DRW           PIC X(1) VALUE '3'.
      * 功能3 ：支取
             10 C-SA-GET-UFRZ          PIC X(1) VALUE '4'.
      * 功能4 ：该分期之后的事故解冻、续冻
             10 C-SA-GET-FRZ           PIC X(1) VALUE '5'.
      * 功能5 ：新增金额冻结
             10 C-SA-DRW-UFRZ          PIC X(1) VALUE '6'.
      * 功能6：扣划解冻
             10 C-SA-UFRZ-DRW          PIC X(1) VALUE '7'.
      * 功能7：扣划支取
      * 分期冻结的分期方式  2-按季；1-按月；3-按年
         05 C-SA-PER-TYPE.
             10 C-SA-PER-S             PIC X(1) VALUE '2'.
             10 C-SA-PER-M             PIC X(1) VALUE '1'.
             10 C-SA-PER-Y             PIC X(1) VALUE '3'.
      * 留存周期 1-留存固定金额
         05 C-SA-PER-REMN-CYC.
             10 C-SA-REMN-AMT           PIC X(1) VALUE '1'.
      * 账户性质子类-验资户
         05 C-SA-SUB-CHAR.
      * 03-验资户
             10 C-SA-SUB-CHAR-YZ       PIC X(2) VALUE '03'.
      * 账户种类维护功能
         05 C-SA-FUNC1.
             10 C-SA-II-UPG-I          PIC X(1) VALUE '1'.
      *      功能1：II类升I类
             10 C-SA-III-UPG-I         PIC X(1) VALUE '2'.
      *      功能2：III类升I类
             10 C-SA-III-UPG-II        PIC X(1) VALUE '3'.
      *      功能3：III类升II类
             10 C-SA-I-DEM-II          PIC X(1) VALUE '4'.
      *      功能4：I类降II类
             10 C-SA-I-DEM-III         PIC X(1) VALUE '5'.
      *      功能5：I类降III类
             10 C-SA-II-DEM-III        PIC X(1) VALUE '6'.
      *      功能6：II类降III类
         05 C-SA-FUN.
             10 C-SA-UPG               PIC X(1) VALUE '1'.
      *      功能：升级
             10 C-SA-DEM               PIC X(1) VALUE '2'.
      *      功能：降级

      * 密码/指纹维护操作类型
         05 C-SA-PSWD-FINGER.
             10 C-SA-UPDATE-PSWD       PIC X(8) VALUE '修改密码'.
             10 C-SA-ADD-PSWD          PIC X(8) VALUE '新增密码'.
             10 C-SA-DEL-PSWD          PIC X(8) VALUE '取消密码'.
             10 C-SA-ADD1-FINGER       PIC X(8) VALUE '增加指纹'.
             10 C-SA-DEL-FINGER        PIC X(8) VALUE '取消指纹'.
             10 C-SA-DEL1-FINGER       PIC X(8) VALUE '作废指纹'.
             10 C-SA-RSET-PSWD         PIC X(8) VALUE '重置密码'.
         05 C-SA-AFR2-FUNC.
      *    1-批量冻结-超额默认账户可用余额
            10 C-SA-AFR2-FRZ1           PIC X(1) VALUE '1'.
      *    2-批量冻结-不允许超额
            10 C-SA-AFR2-FRZ2           PIC X(1) VALUE '2'.
      *    3-批量冻结解冻
            10 C-SA-AFR2-UFRZ           PIC X(1) VALUE '3'.

      * 账户超期控制
         05 C-SA-OVERDUE-CTL-STS.
      * 超期控制
            10 C-SA-OVERDUE-LOCK       PIC X(1) VALUE '1'.
      * 超期解控
            10 C-SA-OVERDUE-UNLOCK     PIC X(1) VALUE '0'.

      * 审批状态
         05 C-SA-APPROVE-STS.
      * 初始状态
            10 C-SA-APPROVE-SAVE       PIC X(1) VALUE '0'.
      * 待审批
            10 C-SA-APPROVE-ON         PIC X(1) VALUE '1'.
      * 审批已通过
            10 C-SA-APPROVE-OVER       PIC X(1) VALUE '2'.
      * 审批未通过
            10 C-SA-APPROVE-NO         PIC X(1) VALUE '3'.
      * 申请取消
      *     10 C-SA-APPROVE-CANCEL     PIC X(1) VALUE '4'.
      * 记账成功
            10 C-SA-UNAPPROVE-OVER     PIC X(1) VALUE '5'.
      * 未审核已失效
            10 C-SA-UNAPPROVE-NO       PIC X(1) VALUE '4'.
      * CSAAFR3 冻结类型
        05 C-SA-FRZ-TYP.
      *    存款证明
           10 C-SA-FRZ-CIF             PIC X(1) VALUE '0'.
      *    保证金冻结
           10 C-SA-FRZ-GRT             PIC X(1) VALUE '1'.
      *    保证金扣押
           10 C-SA-FRZ-DTN             PIC X(1) VALUE '2'.
      *    银承保证金扣押
           10 C-SA-FRZ-YCGRT           PIC X(1) VALUE '3'.

      * 功能号
        05 C-SA-FUN.
           10 C-SA-FUN-0               PIC X(1) VALUE '0'.
           10 C-SA-FUN-1               PIC X(1) VALUE '1'.
           10 C-SA-FUN-2               PIC X(1) VALUE '2'.
           10 C-SA-FUN-3               PIC X(1) VALUE '3'.
           10 C-SA-FUN-4               PIC X(1) VALUE '4'.
           10 C-SA-FUN-5               PIC X(1) VALUE '5'.
           10 C-SA-FUN-6               PIC X(1) VALUE '6'.
           10 C-SA-FUN-7               PIC X(1) VALUE '7'.
           10 C-SA-FUN-8               PIC X(1) VALUE '8'.
           10 C-SA-FUN-9               PIC X(1) VALUE '9'.
           10 C-SA-FUN-S               PIC X(1) VALUE 'S'.
           10 C-SA-FUN-P               PIC X(1) VALUE 'P'.
      * 1338卡折标识
        05 C-SA-CR-PSBK-FLAG.
      * 卡
           10 C-SA-CR-FLAG             PIC X(1) VALUE '1'.
      * 折
           10 C-SA-PSBK-FLAG           PIC X(1) VALUE '0'.
      * PCSATEMP I-TBL-TYPE 操作表类型
        05 C-SA-TBL-TYPE.
           10 C-SA-TBL-ACN             PIC X(1) VALUE '1'.
      * 活期主档
           10 C-SA-TBL-AMT             PIC X(1) VALUE '2'.
      * 活期资金档
           10 C-SA-TBL-AGR             PIC X(1) VALUE '3'.
      * 活期协议档

      * GSA01221 账户启用
        05 C-SA-CAN-REASON-CODE.
      *    注销原因

           10 C-SA-DATE-NO-COP         PIC X(2) VALUE '01'.
      *    申请资料不合规
           10 C-SA-DATE-NO-MAG         PIC X(2) VALUE '02'.
      *    申请资料与实际经营情况不符
           10 C-SA-PBC-NO-PASS         PIC X(2) VALUE '03'.
      *    人行核准/备案未通过
           10 C-SA-OTHER               PIC X(2) VALUE '04'.
      *    其他
      *  年检维护状态
        05 C-SA-AS-STS.
      *    启用
           10 C-SA-STA                 PIC X(1) VALUE '1'.
      *    关闭
           10 C-SA-CLE                 PIC X(1) VALUE '2'.
      *    关闭重开
           10 C-SA-CLE-STA             PIC X(1) VALUE '3'.

        05 C-SA-BND-STS.
      *    绑定状态
           10 C-SA-BIND-SUCC           PIC X(1) VALUE '1'.
      *    绑定成功
           10 C-SA-UNBIND              PIC X(1) VALUE '2'.
      *    无效（已解除）

      *    活期产品不动户部件档-转长期不动户执行标志（ADD BY QIK）
        05 C-SA-TIC-ACC-DATE-FLG.
      *    每年12月转
           10 C-SA-DATE-FLG-Y          PIC X(1) VALUE '1'.
      *    每年6，12月转
           10 C-SA-DATE-FLG-HY         PIC X(1) VALUE '2'.
      *    每年3, 6，9, 12月转
           10 C-SA-DATE-FLG-S          PIC X(1) VALUE '3'.
      *    每年每月转
           10 C-SA-DATE-FLG-M          PIC X(1) VALUE '4'.

       05  C-SA-UPDT-TYP.
      *    授权用途
           10 C-SA-UPDT-TYP-SA         PIC X(1) VALUE '1'.
      *       活期存款
           10 C-SA-UPDT-TYP-NGO        PIC X(1) VALUE '2'.
      *       协定存款

       05  C-SA-GUR-INTR-FLG.
      *    保证金入账方式
           10 C-SA-GUR-INTR-SETL       PIC X(1) VALUE '3'.
      *       入结算账户
           10 C-SA-GUR-INTR-MARG       PIC X(1) VALUE '1'.
      *       入保证金账户

       05  C-SA-GUR-FLG.
      *    保证金标志
           10 C-SA-GUR-NO              PIC X(1) VALUE '0'.
      *       非保证金账户
           10 C-SA-GUR-YES             PIC X(1) VALUE '1'.
      *       保证金账户
       05  C-SA-ONE-C-LMT              PIC X(10) VALUE '15SA000001'.
      *    银行级限额单笔支取限额控制参数
       05  C-SA-ONE-D-LMT              PIC X(10) VALUE '15SA000002'.
      *    银行级限额单笔存入限额控制参数
       05  C-SA-ONES-C-LMT             PIC X(10) VALUE '14SA000003'.
      *    银行级限额累计支取限额控制参数
       05  C-SA-ONES-D-LMT             PIC X(10) VALUE '14SA000004'.
      *    银行级限额累计存入限额控制参数
       05  C-SA-I-SING-TYP             PIC X(2)  VALUE '07'.
      *    账户种类签约
       05  C-SA-DRW-TYPE               PIC X(2)  VALUE '16'.
      *    支取交易
       05  C-SA-DEP-TYPE               PIC X(2)  VALUE '17'.
      *    存入交易

       05  C-SA-ONE-LMT                PIC X(10) VALUE 'ONE001'.
      *    账户种类单笔限额

       05  C-SA-TOTAL-LMT              PIC X(10) VALUE 'TOTAL01'.
      *    账户种类累计限额


       05  C-SA-ACCT-TYP-RMB           PIC X(4) VALUE '1156'.
      *    帐别（人民币）

      *************************************************
      * 银联卡资金清算业务优化:商户结算账户圈存状态
      *************************************************
       05  C-SA-LOCK-AFREEZE           PIC X(1)  VALUE  '1'.
      *圈存
       05  C-SA-UNLOCK-AFREEZE         PIC X(1)  VALUE  '2'.
      *已解圈存
      *******************************************
      * 产品代码常量
      ******************************************
      *  活期储蓄存单
       05  C-SA-SAT-SAVBRE             PIC X(11) VALUE '999SA000005'.

       05  C-SA-AVL-FLG.
      *零余额账户有效标志
           10 C-SA-AVL-VALID           PIC X(1) VALUE '0'.
      * 有效
           10 C-SA-AVL-INVALID         PIC X(1) VALUE '1'.
      * 无效

       05  C-SA-TRLST-TYPE.
      *白名单类型
           10 C-SA-TRLST-TYPE-01       PIC X(2) VALUE '01'.
      * 监管
           10 C-SA-TRLST-TYPE-02       PIC X(2) VALUE '02'.
      * 托管

       05  C-SPV-MODE.
      *监管方式
           10 C-SA-SPV-MODE-1          PIC X(1) VALUE '1'.
      * 1:收款监管
           10 C-SA-SPV-MODE-2          PIC X(1) VALUE '2'.
      * 2:付款监管
           10 C-SA-SPV-MODE-3          PIC X(1) VALUE '3'.
      * 3:收付款监管

       05  C-COL-FEE-FLG.
      *托管费收费标志
           10 C-SA-COL-FEE-FLG-0       PIC X(1) VALUE '0'.
      * 0不收费
           10 C-SA-COL-FEE-FLG-1       PIC X(1) VALUE '1'.
      * 1按比例收费
           10 C-SA-COL-FEE-FLG-2       PIC X(1) VALUE '2'.
      * 2按固定金额收费
           10 C-SA-COL-FEE-FLG-3       PIC X(1) VALUE '3'.
      * 3按固定金额加比例收费

       05  C-SPC-ACCT-ATTR.
      *特殊账户属性
           10 C-SA-DIPA-ATTR-01        PIC X(2) VALUE '01'.
      * 支付机构备付金账户属性：01存管账户
           10 C-SA-DIPA-ATTR-02        PIC X(2) VALUE '02'.
      * 支付机构备付金账户属性：02收付账户
           10 C-SA-DIPA-ATTR-03        PIC X(2) VALUE '03'.
      * 支付机构备付金账户属性：03汇缴账户
           10 C-SA-ZBA-ATTR-01         PIC X(2) VALUE '01'.
      * 零余额账户属性：01财政部门零余额账户
           10 C-SA-ZBA-ATTR-02         PIC X(2) VALUE '02'.
      * 零余额账户属性：02预算单位零余额账户
           10 C-SA-ZBA-ATTR-03         PIC X(2) VALUE '03'.
      * 零余额账户属性：03财政汇缴零余额账户（财政汇缴专户）
           10 C-SA-CA-ATTR-01          PIC X(2) VALUE '01'.
      * 托管账户属性：01证券投资基金产品托管账户
           10 C-SA-CA-ATTR-02          PIC X(2) VALUE '02'.
      * 托管账户属性：02基金管理公司特定客户资产管理计划托管账户
           10 C-SA-CA-ATTR-03          PIC X(2) VALUE '03'.
      * 托管账户属性：03基金子公司特定客户资产管理计划托管账户
           10 C-SA-CA-ATTR-04          PIC X(2) VALUE '04'.
      * 托管账户属性：04证券公司客户资产管理托管账户
           10 C-SA-CA-ATTR-05          PIC X(2) VALUE '05'.
      * 托管账户属性：05期货公司资产管理计划托管账户
           10 C-SA-CA-ATTR-06          PIC X(2) VALUE '06'.
      * 托管账户属性：06保险资产托管账户
           10 C-SA-CA-ATTR-07          PIC X(2) VALUE '07'.
      * 托管账户属性：07保险资产管理计划托管账户
           10 C-SA-CA-ATTR-08          PIC X(2) VALUE '08'.
      * 托管账户属性：08合格境内投资托管账户（含QDII、RQDII、QDIE）
           10 C-SA-CA-ATTR-09          PIC X(2) VALUE '09'.
      * 托管账户属性：09合格境外投资托管账户（含QFII、RQFII）
           10 C-SA-CA-ATTR-10          PIC X(2) VALUE '10'.
      * 托管账户属性：10信托财产托管账户
           10 C-SA-CA-ATTR-11          PIC X(2) VALUE '11'.
      * 托管账户属性：11银行理财产品托管账户
           10 C-SA-CA-ATTR-12          PIC X(2) VALUE '12'.
      * 托管账户属性：12私募证券投资基金托管账户
           10 C-SA-CA-ATTR-13          PIC X(2) VALUE '13'.
      * 托管账户属性：13私募股权投资基金托管账户
           10 C-SA-CA-ATTR-14          PIC X(2) VALUE '14'.
      * 托管账户属性：14其他托管账户
           10 C-SA-CA-ATTR-15          PIC X(2) VALUE '15'.
      * 托管账户属性：15社会保障基金托管账户
           10 C-SA-CA-ATTR-16          PIC X(2) VALUE '16'.
      * 托管账户属性：16企业年金基金受托财产托管账户
           10 C-SA-CA-ATTR-17          PIC X(2) VALUE '17'.
      * 托管账户属性：17企业年金基金投资资产托管账户
           10 C-SA-CA-ATTR-18          PIC X(2) VALUE '18'.
      * 托管账户属性：18企业年金基金投资管理风险准备金账户
           10 C-SA-CA-ATTR-19          PIC X(2) VALUE '19'.
      * 托管账户属性：19客户资金托管账户
           10 C-SA-CA-ATTR-20          PIC X(2) VALUE '20'.
      * 托管账户属性：20跨境投资产品托管账户
           10 C-SA-SVA-ATTR-01         PIC X(2) VALUE '01'.
      * 监管账户属性：01贷款类监管账户
           10 C-SA-SVA-ATTR-02         PIC X(2) VALUE '02'.
      * 监管账户属性：02房产类监管账户
           10 C-SA-SVA-ATTR-03         PIC X(2) VALUE '03'.
      * 监管账户属性：03基建类监管账户
           10 C-SA-SVA-ATTR-04         PIC X(2) VALUE '04'.
      * 监管账户属性：04大额交易类监管账户
           10 C-SA-SVA-ATTR-05         PIC X(2) VALUE '05'.
      * 监管账户属性：05农民工工资保证金监管账户
           10 C-SA-SVA-ATTR-06         PIC X(2) VALUE '06'.
      * 监管账户属性：06其他类监管账户

       05  C-SA-BND-METH.
      *    绑定方式
           10 C-SA-INNER               PIC X(1) VALUE '1'.
      *    1-行内
           10 C-SA-CROSS               PIC X(1) VALUE '2'.
      *    2-跨行

      *    升降级介质类型
       05  C-SA-PME-FLG.

           10 C-SA-PSBK                PIC X(1) VALUE '0'.
      *     0-折介质
           10 C-SA-CR                  PIC X(1) VALUE '1'.
      *     1-实体卡介质
           10 C-SA-VCR                 PIC X(1) VALUE '2'.
      *     2-虚拟卡介质
       05  C-SA-PME-STS.
      *    存折介质状态
           10 C-SA-PME-NORMAL          PIC X(1) VALUE '0'.
      *    0-正常
           10 C-SA-PME-CANCEL          PIC X(1) VALUE '1'.
      *    1-作废
       05  C-SA-FREE-ITEM.                                
      *    免费项目                                       
           10 C-SA-FREE-ITEM-1         PIC X(1) VALUE '1'.
      *    1-年费                                         
           10 C-SA-FREE-ITEM-2         PIC X(1) VALUE '2'.
      *    2-个人小额账户管理费   
                              
      *   GSA01212一户通销户
       05 C-SA-CAA-CANCEL.
      *    主账户销户
           10 C-SA-CAA-MAIN-CANCEL  PIC X(02) VALUE '01'.
      *    子账户销户
           10 C-SA-CAA-SUB-CANCEL   PIC X(02) VALUE '00'.
       05 C-SA-TEMPACC-CTL-TYP.
      *          0-解控
           10 C-SA-TEMPACC-OPEN-0   PIC X(1) VALUE '0'.
      *          1-控制
           10 C-SA-TEMPACC-CLOSE-1  PIC X(1) VALUE '1'.
